content/neo/neo.org
:PROPERTIES:
:TOC:      :include all
:END:
#+TITLE: Emacs Configuration
#+DESCRIPTION: An org-babel based emacs configuration I find useful
#+LANGUAGE: en
#+PROPERTY: results silent
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/org.css"/>


:CONTENTS:

:END:

* Table of Contents :TOC:
:PROPERTIES:
:TOC:      :include all
:END:

For theming:
https://github.com/fniessen/org-html-themes

* Introduction
  This is my personal Emacs configuration. This is not the first time
  I declare [[https://www.emacswiki.org/emacs/DotEmacsBankruptcy][Emacs bankrupcy]] and start over with a new emacs life.

  It is not intended to be general or beginner-friendly. If you're a
  beginner you'll probably be better off with one of the many emacs
  configurations with batteries included.

  Also, my Emacs stays on for weeks or months at a time; I'm not
  interested in reducing startup time or delaying loading of packages
  until they're first used. It simply doesn't affect me.  This is
  another motif for looking somewhere else. Distributions like
  spacemacs or doom spend quite a lot of time in making startup fast,
  you'll be appier with them.

  If you're still with me, you still probably shouldn't take this
  configuration in its entirety. Rather, cherry pick parts you find
  interesting and port them to your own configuration.

  /Abandon All Hope, Ye Who Enter Here/


* General  
** System Configuration
** Emacs Startup
When testing changes to the Emacs configuration it is useful to
be able to restart Emacs from within Emacs. The following allows to
restart Emacs when C-x C-c (normally bound to save-buffers-kill-Emacs)
is invoked with a universal argument.

Note that when we restart Emacs, all open files and frames are
restored (courtesy of the desktop package if installed). We also retrieve the
initial command line arguments. ~restart-emacs~ doesn't do this as
there's no platform independent way for doing it. Note that
~command-line-args~ is not sufficient as many arguments are deleted
while being processed by the Emacs C code (for instance ~--debug-init~ )
I'd still think that it would be better than completely ignoring them,
but I'm not the author of the ~restart-emacs~ package. Here I collect
arguments from the ~/proc~ file system, I only care about Linux anyhow.

#+BEGIN_SRC emacs-lisp
  (defun neo/emacs-args ()
    (with-temp-buffer
      (insert-file-contents "/proc/self/cmdline")
      (split-string (buffer-string) "\0" t)))

  (defun neo/restart-emacs-or-exit (arg)
    (interactive "P")
    (if arg
        (restart-emacs (cdr (neo/emacs-args)))
      (save-buffers-kill-emacs)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package restart-emacs
    :bind
    ("C-x C-c" . neo/restart-emacs-or-exit))
#+END_SRC

Future development, use transient
#+begin_src emacs-lisp :tangle no
  (use-package transient-posframe
    :config
  (transient-posframe-mode)
  )
  
    (defun neo/exit-emacs (&optional args)
      (interactive
       (list (transient-args 'neo/exit-emacs-transient)))
      (message "args %s" args))
  
  
  (define-transient-command neo/exit-emacs-transient ()
           "Test Transient Title"
           ["Releases"
              ("-x" "Emacs" "--executable=")
            ("-p" "Profile" "--with-profile=")]
           ["Actions"
            ("r" "Restart Emacs" neo/exit-emacs)
            ("x" "Exit Emacs" neo/exit-emacs)])
  
    (neo/exit-emacs-transient)
  
  
  (defun sort-emacs-releases (r1 r2)
    (let ((n1 (car r1))
          (t1 (cdr r1))
          (n2 (car r2))
          (t2 (cdr r2)))
      (if (and (string-prefix-p "master-" n1)
               (string-prefix-p "master-" n2))
          (< t1 t2)
        (if (string-prefix-p "master-" n1)
            nil
          (if (string-prefix-p "master-" n2)
              t
            (version< n1 n2))))))
  
  (setq l (sort (mapcar
                 (lambda (e) (cons
                              (car e)
                              (time-convert (file-attribute-access-time (cdr e)) 'integer)))
                 (directory-files-and-attributes "/usr/local/emacs_dist" nil "^[0-9a-z]" nil t)) #'sort-emacs-releases))
  
  (mapcar (lambda (e) (format "%s %s" (car e) (format-time-string "%Y %B %e" (cdr e)))) l)
  
#+end_src

Let's add to the load path our own local packages. Some of them might
one day graduate and be their own package.

#+begin_src emacs-lisp
  (let ((default-directory (concat (file-name-as-directory user-emacs-directory) "local")))
    (normal-top-level-add-subdirs-to-load-path))
#+end_src
