neo/neo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Configuration</title>
<meta name="generator" content="Org mode" />
<meta name="description" content="An org-babel based emacs configuration I find useful"
 />
<link rel="stylesheet" type="text/css" href="css/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Emacs Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6629d20">Table of Contents&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOC">TOC</span></span></a></li>
<li><a href="#org7cff5de">Introduction</a></li>
<li><a href="#org9c15687">General</a>
<ul>
<li><a href="#org5748674">System Configuration</a></li>
<li><a href="#org5c54678">Emacs Startup</a></li>
<li><a href="#org9514f49">Package Configurations</a></li>
<li><a href="#org726bb2f">Reasonable Defaults</a></li>
<li><a href="#orgc330344">Save Areas</a>
<ul>
<li><a href="#orgc2f17c4">Garbage</a></li>
<li><a href="#orga39814b">Autosave</a></li>
<li><a href="#orge04c8aa">Backups</a></li>
<li><a href="#org220ef49">Destop Save</a></li>
<li><a href="#orgecfd835">Variables</a></li>
</ul>
</li>
<li><a href="#org9f58432">Native Compilation</a></li>
<li><a href="#orgdcc51eb">Secrets</a></li>
<li><a href="#org6bc181f">Documentation</a></li>
<li><a href="#orgbf81936">Misc</a></li>
</ul>
</li>
<li><a href="#orge3d1a19">Completion</a></li>
<li><a href="#org89e39e6">User Interface</a>
<ul>
<li><a href="#orgfffba8b">Appearance</a>
<ul>
<li><a href="#org93543d5">Themes</a></li>
<li><a href="#orgbbeb55e">Fonts</a></li>
<li><a href="#orgd32ed78">Windows</a></li>
<li><a href="#org098d99d">Modeline</a></li>
<li><a href="#org55f8ddd">Icons</a></li>
<li><a href="#org512b600">Parenthesis</a></li>
<li><a href="#orgc07a62b">Eyecandies</a></li>
</ul>
</li>
<li><a href="#orga471e13">Keybindings</a>
<ul>
<li><a href="#org1ce995e">Memory Aids</a></li>
<li><a href="#org68c1526">Global Keybindings</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org873a11b">Movement</a></li>
<li><a href="#org6bc524f">Undo</a></li>
<li><a href="#org02c251b">Software Development</a>
<ul>
<li><a href="#org32a1fa2">Version Control</a>
<ul>
<li><a href="#orgb62a244">Git</a></li>
<li><a href="#org33d9451">Magit</a></li>
</ul>
</li>
<li><a href="#orgf4861a5">Build Systems</a></li>
<li><a href="#orgcdb6fbd">Linters</a></li>
<li><a href="#org814e7d7">Languages</a>
<ul>
<li><a href="#org1c97669">Emacs Lisp</a></li>
<li><a href="#orge55ea1d">Python</a></li>
<li><a href="#orgb45020e">C++</a></li>
<li><a href="#org60c123b">Haskell</a></li>
<li><a href="#orgf62622c">Shell</a></li>
<li><a href="#org66ee019">Markdown</a></li>
<li><a href="#org30f2c9a">Bazel</a></li>
<li><a href="#orgde62176">TeX</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9961409">Applications</a>
<ul>
<li><a href="#orgebb9553">Org Mode</a>
<ul>
<li><a href="#orgb5e2fc4">Beautification</a></li>
<li><a href="#org7b57465">Applications</a></li>
</ul>
</li>
<li><a href="#orgbf05f0e">Dashboard</a></li>
<li><a href="#orgec0aa4f">Calculator</a></li>
<li><a href="#org70633e7">Calendar</a></li>
<li><a href="#org571d481">File Browser</a></li>
<li><a href="#org716ea47">Shell</a></li>
<li><a href="#orgf4bfc98">Alert</a></li>
<li><a href="#orge5b0adc">File Browser</a></li>
</ul>
</li>
<li><a href="#orgcb8bdda">Fun</a>
<ul>
<li><a href="#org1a82c16">Music</a>
<ul>
<li><a href="#org8f202c8">Player</a></li>
<li><a href="#org8241da3">Lyrics</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2d21c9a">Unclassified Packages</a></li>
</ul>
</div>
</div>
<p>
:TOC:      :include all
</p>
<p>

</p>

<div id="outline-container-org6629d20" class="outline-2">
<h2 id="org6629d20">Table of Contents&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOC">TOC</span></span></h2>
<div class="outline-text-2" id="text-org6629d20">
<p>
For theming:
<a href="https://github.com/fniessen/org-html-themes">https://github.com/fniessen/org-html-themes</a>
</p>
</div>
</div>

<div id="outline-container-org7cff5de" class="outline-2">
<h2 id="org7cff5de">Introduction</h2>
<div class="outline-text-2" id="text-org7cff5de">
<p>
This is my personal Emacs configuration. This is not the first time
I declare <a href="https://www.emacswiki.org/emacs/DotEmacsBankruptcy">Emacs bankrupcy</a> and start over with a new emacs life.
</p>

<p>
It is not intended to be general or beginner-friendly. If you're a
beginner you'll probably be better off with one of the many emacs
configurations with batteries included.
</p>

<p>
Also, my Emacs stays on for weeks or months at a time; I'm not
interested in reducing startup time or delaying loading of packages
until they're first used. It simply doesn't affect me.  This is
another motif for looking somewhere else. Distributions like
spacemacs or doom spend quite a lot of time in making startup fast,
you'll be appier with them.
</p>

<p>
If you're still with me, you still probably shouldn't take this
configuration in its entirety. Rather, cherry pick parts you find
interesting and port them to your own configuration.
</p>

<p>
<i>Abandon All Hope, Ye Who Enter Here</i>
</p>
</div>
</div>


<div id="outline-container-org9c15687" class="outline-2">
<h2 id="org9c15687">General</h2>
<div class="outline-text-2" id="text-org9c15687">
</div>
<div id="outline-container-org5748674" class="outline-3">
<h3 id="org5748674">System Configuration</h3>
</div>
<div id="outline-container-org5c54678" class="outline-3">
<h3 id="org5c54678">Emacs Startup</h3>
<div class="outline-text-3" id="text-org5c54678">
<p>
When testing changes to the Emacs configuration it is useful to
be able to restart Emacs from within Emacs. The following allows to
restart Emacs when C-x C-c (normally bound to save-buffers-kill-Emacs)
is invoked with a universal argument.
</p>

<p>
Note that when we restart Emacs, all open files and frames are
restored (courtesy of the desktop package if installed). We also retrieve the
initial command line arguments. <code>restart-emacs</code> doesn't do this as
there's no platform independent way for doing it. Note that
<code>command-line-args</code> is not sufficient as many arguments are deleted
while being processed by the Emacs C code (for instance <code>--debug-init</code> )
I'd still think that it would be better than completely ignoring them,
but I'm not the author of the <code>restart-emacs</code> package. Here I collect
arguments from the <code>/proc</code> file system, I only care about Linux anyhow.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">neo/emacs-args</span> ()
  (<span style="font-weight: bold;">with-temp-buffer</span>
    (insert-file-contents <span style="font-style: italic;">"/proc/self/cmdline"</span>)
    (split-string (buffer-string) <span style="font-style: italic;">"\0"</span> t)))

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">neo/restart-emacs-or-exit</span> (arg)
  (<span style="font-weight: bold;">interactive</span> <span style="font-style: italic;">"P"</span>)
  (<span style="font-weight: bold;">if</span> arg
      (restart-emacs (cdr (neo/emacs-args)))
    (save-buffers-kill-emacs)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package restart-emacs
  <span style="font-weight: bold;">:bind</span>
  (<span style="font-style: italic;">"C-x C-c"</span> . neo/restart-emacs-or-exit))
</pre>
</div>

<p>
Future development, use transient
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package transient-posframe
  <span style="font-weight: bold;">:config</span>
(transient-posframe-mode)
)

  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">neo/exit-emacs</span> (<span style="font-weight: bold; text-decoration: underline;">&amp;optional</span> args)
    (<span style="font-weight: bold;">interactive</span>
     (list (transient-args 'neo/exit-emacs-transient)))
    (message <span style="font-style: italic;">"args %s"</span> args))


(define-transient-command neo/exit-emacs-transient ()
         <span style="font-style: italic;">"Test Transient Title"</span>
         [<span style="font-style: italic;">"Releases"</span>
            (<span style="font-style: italic;">"-x"</span> <span style="font-style: italic;">"Emacs"</span> <span style="font-style: italic;">"--executable="</span>)
          (<span style="font-style: italic;">"-p"</span> <span style="font-style: italic;">"Profile"</span> <span style="font-style: italic;">"--with-profile="</span>)]
         [<span style="font-style: italic;">"Actions"</span>
          (<span style="font-style: italic;">"r"</span> <span style="font-style: italic;">"Restart Emacs"</span> neo/exit-emacs)
          (<span style="font-style: italic;">"x"</span> <span style="font-style: italic;">"Exit Emacs"</span> neo/exit-emacs)])

  (neo/exit-emacs-transient)


(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">sort-emacs-releases</span> (r1 r2)
  (<span style="font-weight: bold;">let</span> ((n1 (car r1))
        (t1 (cdr r1))
        (n2 (car r2))
        (t2 (cdr r2)))
    (<span style="font-weight: bold;">if</span> (<span style="font-weight: bold;">and</span> (string-prefix-p <span style="font-style: italic;">"master-"</span> n1)
             (string-prefix-p <span style="font-style: italic;">"master-"</span> n2))
        (&lt; t1 t2)
      (<span style="font-weight: bold;">if</span> (string-prefix-p <span style="font-style: italic;">"master-"</span> n1)
          nil
        (<span style="font-weight: bold;">if</span> (string-prefix-p <span style="font-style: italic;">"master-"</span> n2)
            t
          (version&lt; n1 n2))))))

(<span style="font-weight: bold;">setq</span> l (sort (mapcar
               (<span style="font-weight: bold;">lambda</span> (e) (cons
                            (car e)
                            (time-convert (file-attribute-access-time (cdr e)) 'integer)))
               (directory-files-and-attributes <span style="font-style: italic;">"/usr/local/emacs_dist"</span> nil <span style="font-style: italic;">"^[0-9a-z]"</span> nil t)) <span style="font-weight: bold;">#'sort-emacs-releases))</span>

(mapcar (<span style="font-weight: bold;">lambda</span> (e) (format <span style="font-style: italic;">"%s %s"</span> (car e) (format-time-string <span style="font-style: italic;">"%Y %B %e"</span> (cdr e)))) l)

</pre>
</div>

<p>
Let's add to the load path our own local packages. Some of them might
one day graduate and be their own package.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">let</span> ((default-directory (concat (file-name-as-directory user-emacs-directory) <span style="font-style: italic;">"local"</span>)))
  (normal-top-level-add-subdirs-to-load-path))
</pre>
</div>
</div>
</div>
