content/neo/neo.org
** Package Configurations
We use ~straight.el~ for package installation, but ~use-package~ for
configuration. Here we setup a few useful extensions.

The modeline becomes unwieldy when lot of minor modes try to say
things there. We were using ~diminish~, but it seems that now
~delight~ can completely replace it.

#+begin_src emacs-lisp
  (use-package delight)
#+end_src

In theory, ~use-package-chord~ is deprecated and the functionality built-in
into ~use-package~. In practice, without it I cannot get the ~:chords~
keyword to work.

#+begin_src emacs-lisp
  (use-package use-package-chords
    :config (key-chord-mode 1))
#+end_src

My understanding is that ensure-system-package has been folded into
the ~use-package~ package. It doesn't seem the case in my version.
  - verify this

#+BEGIN_SRC emacs-lisp
  (use-package system-packages
    :config
    (setq system-packages-package-manager 'apt)
    (setq system-packages-use-sudo t)
    )
#+end_src

#+begin_src emacs-lisp
  (use-package use-package-ensure-system-package)
#+END_SRC

Let's get some utilities for straight package management. For instance ~straight-x-pull-all~

#+begin_src emacs-lisp
(require 'straight-x)  
#+end_src
  
#+begin_src emacs-lisp
      (use-package emacs
        :delight
        (org-indent-mode)
        (auto-revert-mode " AR")
        (auto-fill-function " AF"))
#+end_src

** Reasonable Defaults
Speaking only for myself, claro?

#+begin_src emacs-lisp
  (use-package emacs
    :config
    (add-to-list 'initial-frame-alist '(fullscreen . maximized))
    (setq message-log-max 10000) ; I cannot have t as my Emacs stays on forever
    (setq kill-whole-line t)
    (setq visible-bell 1)
    (setq initial-scratch-message "")
    (setq inhibit-splash-screen t)
    (setq inhibit-startup-screen t)
    (setq inhibit-startup-buffer-menu t)
    (setq use-dialog-box nil)
    (setq ring-bell-function 'ignore)
    (setq-default truncate-lines t)
    (setq-default indent-tabs-mode nil)
    (setq custom-safe-themes t) ; not sure, I'll probaby use very few themes no need to trust 'em all
    (setq scroll-conservatively 10000)    ; not sure abut this one
    (setq scroll-preserve-screen-position t)
    (put 'narrow-to-region 'disabled nil)
    (tool-bar-mode -1)
    (toggle-scroll-bar -1)
    (toggle-menu-bar-mode-from-frame -1)
    (tooltip-mode -1)
    (blink-cursor-mode 0)
    (set-fringe-mode '(10 . 0))
    (fset 'yes-or-no-p 'y-or-n-p)
    ;; The following is mainly for avoiding the
    ;; 'Symbolic link to Git-controlled source file; follow link? (y or n)'
    ;; question every time I get to a package source via find-library or
    ;; find-function. The question could be avoided with
    ;; (setq vc-follow-symlinks t)
    ;; but since we don't use VC at all, I take the nuclear option.
    (setq vc-handled-backends nil))
#+end_src

** Save Areas

Emacs (and emacs packages) tend to store lot of files in the .emacs.d directory. This wouldn't be
particularly problematic if it wasn't for the fact that my .emacs-*.d is also a git repository. It is
possible to ignore files in git, but it become annoying to have to modify .gitignore just because I
tried a new package. So we will move everything to a ~.save~ directory.

Most of this will be accomplished by the ~no-litter~ package, but we initialize here a few variables
so that the same places can be used by other packages no-litter knows nothing about.

*** Garbage
There is no such thing as garbage, just useful stuff in the wrong place.
I wan tit out of my emacs configuration.

#+begin_src emacs-lisp
  (use-package no-littering
    :init
    ;; Still debating whether these dirs should be per-distro.
    ;(setq no-littering-etc-directory (expand-file-name "~/.emacs-save.d/config"))
    ;(setq no-littering-var-directory (expand-file-name "~/.emacs-save.d/data"))
    (setq no-littering-etc-directory (neo/litter-directory "config"))
    (setq no-littering-var-directory (neo/litter-directory "data"))
    (setq custom-file (expand-file-name "custom.el" no-littering-var-directory)))
#+end_src

*** Autosave
**** Files
By default autosave files are saved in the same directory of the file
they're related to (I think the exception is that remote files are
saved in some local temporary directory). I find this annoying, so I
put them together with the other "garbage".
Autosave files are ephemeral and are deleted when a buffer is saved in
its visited file (by default, but I don't see a reason for changing
that), otherwise it would make sense to discuss whether the git branch
shoud be part of the autosave file name.
#+begin_src emacs-lisp
  :init
  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
#+end_src

**** History
#+begin_src emacs-lisp
  (use-package emacs
    :config
    (savehist-mode))
#+end_src

*** Backups

These is my configuration for backups. The directory itself is set by
no-littering.

#+begin_src emacs-lisp
  (use-package emacs
    :config
    (setq backup-by-copying t)
    (setq delete-old-versions t)
    (setq kept-new-versions 6)
    (setq kept-old-versions 2)
    (setq version-control t))
#+end_src

*** Destop Save

#+BEGIN_SRC emacs-lisp
  (use-package emacs
    :init
    (setq desktop-save t)
    (desktop-save-mode 1))
#+END_SRC
