neo/neo.html
<div id="outline-container-org9514f49" class="outline-3">
<h3 id="org9514f49">Package Configurations</h3>
<div class="outline-text-3" id="text-org9514f49">
<p>
We use <code>straight.el</code> for package installation, but <code>use-package</code> for
configuration. Here we setup a few useful extensions.
</p>

<p>
The modeline becomes unwieldy when lot of minor modes try to say
things there. We were using <code>diminish</code>, but it seems that now
<code>delight</code> can completely replace it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package delight)
</pre>
</div>

<p>
In theory, <code>use-package-chord</code> is deprecated and the functionality built-in
into <code>use-package</code>. In practice, without it I cannot get the <code>:chords</code>
keyword to work.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package use-package-chords
  <span style="font-weight: bold;">:config</span> (key-chord-mode 1))
</pre>
</div>

<p>
My understanding is that ensure-system-package has been folded into
the <code>use-package</code> package. It doesn't seem the case in my version.
</p>
<ul class="org-ul">
<li>verify this</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package system-packages
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> system-packages-package-manager 'apt)
  (<span style="font-weight: bold;">setq</span> system-packages-use-sudo t)
  )
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package use-package-ensure-system-package)
</pre>
</div>

<p>
Let's get some utilities for straight package management. For instance <code>straight-x-pull-all</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">straight-x</span>)  
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package emacs
  <span style="font-weight: bold;">:delight</span>
  (org-indent-mode)
  (auto-revert-mode <span style="font-style: italic;">" AR"</span>)
  (auto-fill-function <span style="font-style: italic;">" AF"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org726bb2f" class="outline-3">
<h3 id="org726bb2f">Reasonable Defaults</h3>
<div class="outline-text-3" id="text-org726bb2f">
<p>
Speaking only for myself, claro?
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package emacs
  <span style="font-weight: bold;">:config</span>
  (add-to-list 'initial-frame-alist '(fullscreen . maximized))
  (<span style="font-weight: bold;">setq</span> message-log-max 10000) <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">I cannot have t as my Emacs stays on forever</span>
  (<span style="font-weight: bold;">setq</span> kill-whole-line t)
  (<span style="font-weight: bold;">setq</span> visible-bell 1)
  (<span style="font-weight: bold;">setq</span> initial-scratch-message <span style="font-style: italic;">""</span>)
  (<span style="font-weight: bold;">setq</span> inhibit-splash-screen t)
  (<span style="font-weight: bold;">setq</span> inhibit-startup-screen t)
  (<span style="font-weight: bold;">setq</span> inhibit-startup-buffer-menu t)
  (<span style="font-weight: bold;">setq</span> use-dialog-box nil)
  (<span style="font-weight: bold;">setq</span> ring-bell-function 'ignore)
  (<span style="font-weight: bold;">setq-default</span> truncate-lines t)
  (<span style="font-weight: bold;">setq-default</span> indent-tabs-mode nil)
  (<span style="font-weight: bold;">setq</span> custom-safe-themes t) <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">not sure, I'll probaby use very few themes no need to trust 'em all</span>
  (<span style="font-weight: bold;">setq</span> scroll-conservatively 10000)    <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">not sure abut this one</span>
  (<span style="font-weight: bold;">setq</span> scroll-preserve-screen-position t)
  (put 'narrow-to-region 'disabled nil)
  (tool-bar-mode -1)
  (toggle-scroll-bar -1)
  (toggle-menu-bar-mode-from-frame -1)
  (tooltip-mode -1)
  (blink-cursor-mode 0)
  (set-fringe-mode '(10 . 0))
  (fset 'yes-or-no-p 'y-or-n-p)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">The following is mainly for avoiding the</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">'Symbolic link to Git-controlled source file; follow link? (y or n)'</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">question every time I get to a package source via find-library or</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">find-function. The question could be avoided with</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(setq vc-follow-symlinks t)</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">but since we don't use VC at all, I take the nuclear option.</span>
  (<span style="font-weight: bold;">setq</span> vc-handled-backends nil))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc330344" class="outline-3">
<h3 id="orgc330344">Save Areas</h3>
<div class="outline-text-3" id="text-orgc330344">
<p>
Emacs (and emacs packages) tend to store lot of files in the .emacs.d directory. This wouldn't be
particularly problematic if it wasn't for the fact that my .emacs-*.d is also a git repository. It is
possible to ignore files in git, but it become annoying to have to modify .gitignore just because I
tried a new package. So we will move everything to a <code>.save</code> directory.
</p>

<p>
Most of this will be accomplished by the <code>no-litter</code> package, but we initialize here a few variables
so that the same places can be used by other packages no-litter knows nothing about.
</p>
</div>

<div id="outline-container-orgc2f17c4" class="outline-4">
<h4 id="orgc2f17c4">Garbage</h4>
<div class="outline-text-4" id="text-orgc2f17c4">
<p>
There is no such thing as garbage, just useful stuff in the wrong place.
I wan tit out of my emacs configuration.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package no-littering
  <span style="font-weight: bold;">:init</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Still debating whether these dirs should be per-distro.</span>
  <span style="font-weight: bold; font-style: italic;">;</span><span style="font-weight: bold; font-style: italic;">(setq no-littering-etc-directory (expand-file-name "~/.emacs-save.d/config"))</span>
  <span style="font-weight: bold; font-style: italic;">;</span><span style="font-weight: bold; font-style: italic;">(setq no-littering-var-directory (expand-file-name "~/.emacs-save.d/data"))</span>
  (<span style="font-weight: bold;">setq</span> no-littering-etc-directory (neo/litter-directory <span style="font-style: italic;">"config"</span>))
  (<span style="font-weight: bold;">setq</span> no-littering-var-directory (neo/litter-directory <span style="font-style: italic;">"data"</span>))
  (<span style="font-weight: bold;">setq</span> custom-file (expand-file-name <span style="font-style: italic;">"custom.el"</span> no-littering-var-directory)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga39814b" class="outline-4">
<h4 id="orga39814b">Autosave</h4>
<div class="outline-text-4" id="text-orga39814b">
</div>
<ul class="org-ul">
<li><a id="org07f8789"></a>Files<br />
<div class="outline-text-5" id="text-org07f8789">
<p>
By default autosave files are saved in the same directory of the file
they're related to (I think the exception is that remote files are
saved in some local temporary directory). I find this annoying, so I
put them together with the other "garbage".
Autosave files are ephemeral and are deleted when a buffer is saved in
its visited file (by default, but I don't see a reason for changing
that), otherwise it would make sense to discuss whether the git branch
shoud be part of the autosave file name.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="font-weight: bold;">:init</span>
(<span style="font-weight: bold;">setq</span> auto-save-file-name-transforms
      `((<span style="font-style: italic;">".*"</span> ,(no-littering-expand-var-file-name <span style="font-style: italic;">"auto-save/"</span>) t)))
</pre>
</div>
</div>
</li>

<li><a id="orgddec460"></a>History<br />
<div class="outline-text-5" id="text-orgddec460">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package emacs
  <span style="font-weight: bold;">:config</span>
  (savehist-mode))
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-orge04c8aa" class="outline-4">
<h4 id="orge04c8aa">Backups</h4>
<div class="outline-text-4" id="text-orge04c8aa">
<p>
These is my configuration for backups. The directory itself is set by
no-littering.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package emacs
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> backup-by-copying t)
  (<span style="font-weight: bold;">setq</span> delete-old-versions t)
  (<span style="font-weight: bold;">setq</span> kept-new-versions 6)
  (<span style="font-weight: bold;">setq</span> kept-old-versions 2)
  (<span style="font-weight: bold;">setq</span> version-control t))
</pre>
</div>
</div>
</div>

<div id="outline-container-org220ef49" class="outline-4">
<h4 id="org220ef49">Destop Save</h4>
<div class="outline-text-4" id="text-org220ef49">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package emacs
  <span style="font-weight: bold;">:init</span>
  (<span style="font-weight: bold;">setq</span> desktop-save t)
  (desktop-save-mode 1))
</pre>
</div>
</div>
</div>
