content/neo/neo.org
*** Variables

I persist global variables by adding them to
~deskop-globals-to-save~. I could have used savehist for this.

** Native Compilation

#+begin_src emacs-lisp
  (use-package emacs
    :init
    (when (boundp 'native-comp-eln-load-path)
      (add-to-list 'native-comp-eln-load-path (neo/litter-directory "eln" emacs-version)))
    (setq native-comp-async-report-warnings-errors 'silent))
#+end_src

  This is for native compilation. Should probably go in
  ~early-init.org~ once we have it. After I figure out what actually
  goes inside ~early-init.el~, maybe it is strictly for before-gui
  things.
  
#+begin_src emacs-lisp
    (if (and (fboundp 'native-comp-available-p)
             (native-comp-available-p))
        (progn
          (message "Native compilation is available")
          (setq comp-deferred-compilation t)
          (setq package-native-compile t)
          (setq native-comp-async-query-on-exit t)
          (setq native-comp-async-jobs-number 0) ; use half of the cores
          (setq native-comp-async-report-warnings-errors nil)
          (setq comp-async-report-warnings-errors nil))
      (message "Native complation is *not* available"))
#+end_src

** Secrets
** Documentation
#+begin_src emacs-lisp
(use-package helpful
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
#+end_src

** Misc
#+begin_src emacs-lisp
(use-package autorevert
  :delight
  :hook (after-init . global-auto-revert-mode))
#+end_src

#+begin_src emacs-lisp
  (use-package ws-butler   
    :config
    (setq ws-butler-keep-whitespace-before-point nil)
    (ws-butler-global-mode)
    :hook ((text-mode . ws-butler-mode)
           (prog-mode . ws-butler-mode)))
#+end_src

#+begin_src emacs-lisp :tangle no
  (use-package whitespace    
    :config
     (setq whitespace-style '(face trailing lines-tail))
    (global-whitespace-mode 1))
#+end_src

Use explain-pause-top 
#+begin_src emacs-lisp
  (use-package explain-pause-mode
    :straight (explain-pause-mode :type git :host github :repo "lastquestion/explain-pause-mode")
    :config
    (explain-pause-mode))
#+end_src

Use sudo for saving the occasional root-owned file.
#+begin_src emacs-lisp
(use-package sudo-save)
#+end_src
* Completion

#+BEGIN_SRC emacs-lisp
  (use-package ivy
    :delight
    )
#+END_SRC

#+begin_src emacs-lisp
  (use-package ivy-rich
    :after all-the-icons-ivy-rich
    :config
    (setq ivy-rich--original-display-transformers-list nil)  ;; needs to be set otherwise (ivy-rich-set-display-transformer) does not get called
    (ivy-set-display-transformer 'ivy-switch-buffer
				 'ivy-rich-switch-buffer-transformer)
    (setq-default ivy-rich-path-style 'abbrev
		  ivy-virtual-abbreviate 'full
		  ivy-rich-switch-buffer-align-virtual-buffer t)
    (ivy-rich-mode 1))
#+end_src

#+begin_src emacs-lisp
    (use-package counsel
      :config
      (ivy-mode 1)
      :bind
      ("<f2> f" . 'counsel-describe-function)
  ;    ("<f2> F" . 'list-faces-display)
      ("<f2> k" . describe-personal-keybindings)
      ("<f2> v" . 'counsel-describe-variable)
      ("<f2> o" . 'counsel-describe-symbol)
      ("<f2> l" . 'counsel-find-library)
      ("<f2> t" . 'neo/load-theme)	; for now, later we'll have a hydra/transient thing
      ("<f2> u" . 'counsel-unicode-char))
#+end_src

#+begin_src emacs-lisp
  (use-package all-the-icons-ivy-rich
    :after ivy
    :config
    (setq all-the-icons-ivy-rich-color-icon t)
    (setq all-the-icons-ivy-rich-icon-size 1.0)
    (setq all-the-icons-ivy-rich-project t)
    (all-the-icons-ivy-rich-mode 1))
#+end_src



#+begin_src emacs-lisp
  (use-package prescient)
#+end_src

#+begin_src emacs-lisp
  (use-package ivy-prescient
    :after counsel
    :config
    (ivy-prescient-mode 1)
    (prescient-persist-mode 1))
#+end_src

#+begin_src emacs-lisp
  (use-package company
    :delight
    :bind (:map company-active-map
           ("TAB" . company-complexivte-common-or-cycle)
           ("<tab>" . company-complete-common-or-cycle)
           ("<S-Tab>" . company-select-previous)
           ("<backtab>" . company-select-previous)
           ("C-n" . company-select-next)
           ("C-p" . company-select-previous))
    :hook (after-init . global-company-mode)
    :custom
    (company-require-match 'never)
    (company-minimum-prefix-length 2)
    (company-tooltip-align-annotations t)
    (company-frontends '(company-pseudo-tooltip-unless-just-one-frontend
                         company-preview-frontend
                         company-echo-metadata-frontend))
    (company-backends '(company-capf company-files))
    (company-tooltip-minimum-width 30)
    (company-tooltip-maximum-width 60))
#+end_src

#+begin_src emacs-lisp
  (use-package company-prescient
    :after company
    :config
    (company-prescient-mode 1))
#+end_src

* User Interface
** Appearance
*** Themes

