neo/neo.html
<div id="outline-container-orgecfd835" class="outline-4">
<h4 id="orgecfd835">Variables</h4>
<div class="outline-text-4" id="text-orgecfd835">
<p>
I persist global variables by adding them to
<code>deskop-globals-to-save</code>. I could have used savehist for this.
</p>
</div>
</div>
</div>

<div id="outline-container-org9f58432" class="outline-3">
<h3 id="org9f58432">Native Compilation</h3>
<div class="outline-text-3" id="text-org9f58432">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package emacs
  <span style="font-weight: bold;">:init</span>
  (<span style="font-weight: bold;">when</span> (boundp 'native-comp-eln-load-path)
    (add-to-list 'native-comp-eln-load-path (neo/litter-directory <span style="font-style: italic;">"eln"</span> emacs-version)))
  (<span style="font-weight: bold;">setq</span> native-comp-async-report-warnings-errors 'silent))
</pre>
</div>

<p>
This is for native compilation. Should probably go in
<code>early-init.org</code> once we have it. After I figure out what actually
goes inside <code>early-init.el</code>, maybe it is strictly for before-gui
things.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">if</span> (<span style="font-weight: bold;">and</span> (fboundp 'native-comp-available-p)
         (native-comp-available-p))
    (<span style="font-weight: bold;">progn</span>
      (message <span style="font-style: italic;">"Native compilation is available"</span>)
      (<span style="font-weight: bold;">setq</span> comp-deferred-compilation t)
      (<span style="font-weight: bold;">setq</span> package-native-compile t)
      (<span style="font-weight: bold;">setq</span> native-comp-async-query-on-exit t)
      (<span style="font-weight: bold;">setq</span> native-comp-async-jobs-number 0) <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">use half of the cores</span>
      (<span style="font-weight: bold;">setq</span> native-comp-async-report-warnings-errors nil)
      (<span style="font-weight: bold;">setq</span> comp-async-report-warnings-errors nil))
  (message <span style="font-style: italic;">"Native complation is *not* available"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdcc51eb" class="outline-3">
<h3 id="orgdcc51eb">Secrets</h3>
</div>
<div id="outline-container-org6bc181f" class="outline-3">
<h3 id="org6bc181f">Documentation</h3>
<div class="outline-text-3" id="text-org6bc181f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package helpful
  <span style="font-weight: bold;">:custom</span>
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  <span style="font-weight: bold;">:bind</span>
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf81936" class="outline-3">
<h3 id="orgbf81936">Misc</h3>
<div class="outline-text-3" id="text-orgbf81936">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package autorevert
  <span style="font-weight: bold;">:delight</span>
  <span style="font-weight: bold;">:hook</span> (after-init . global-auto-revert-mode))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ws-butler   
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> ws-butler-keep-whitespace-before-point nil)
  (ws-butler-global-mode)
  <span style="font-weight: bold;">:hook</span> ((text-mode . ws-butler-mode)
         (prog-mode . ws-butler-mode)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package whitespace    
  <span style="font-weight: bold;">:config</span>
   (<span style="font-weight: bold;">setq</span> whitespace-style '(face trailing lines-tail))
  (global-whitespace-mode 1))
</pre>
</div>

<p>
Use explain-pause-top 
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package explain-pause-mode
  <span style="font-weight: bold;">:straight</span> (explain-pause-mode <span style="font-weight: bold;">:type</span> git <span style="font-weight: bold;">:host</span> github <span style="font-weight: bold;">:repo</span> <span style="font-style: italic;">"lastquestion/explain-pause-mode"</span>)
  <span style="font-weight: bold;">:config</span>
  (explain-pause-mode))
</pre>
</div>

<p>
Use sudo for saving the occasional root-owned file.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package sudo-save)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge3d1a19" class="outline-2">
<h2 id="orge3d1a19">Completion</h2>
<div class="outline-text-2" id="text-orge3d1a19">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ivy
  <span style="font-weight: bold;">:delight</span>
  )
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ivy-rich
  <span style="font-weight: bold;">:after</span> all-the-icons-ivy-rich
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> ivy-rich--original-display-transformers-list nil)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">needs to be set otherwise (ivy-rich-set-display-transformer) does not get called</span>
  (ivy-set-display-transformer 'ivy-switch-buffer
                               'ivy-rich-switch-buffer-transformer)
  (<span style="font-weight: bold;">setq-default</span> ivy-rich-path-style 'abbrev
                ivy-virtual-abbreviate 'full
                ivy-rich-switch-buffer-align-virtual-buffer t)
  (ivy-rich-mode 1))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  (use-package counsel
    <span style="font-weight: bold;">:config</span>
    (ivy-mode 1)
    <span style="font-weight: bold;">:bind</span>
    (<span style="font-style: italic;">"&lt;f2&gt; f"</span> . 'counsel-describe-function)
<span style="font-weight: bold; font-style: italic;">;    </span><span style="font-weight: bold; font-style: italic;">("&lt;f2&gt; F" . 'list-faces-display)</span>
    (<span style="font-style: italic;">"&lt;f2&gt; k"</span> . describe-personal-keybindings)
    (<span style="font-style: italic;">"&lt;f2&gt; v"</span> . 'counsel-describe-variable)
    (<span style="font-style: italic;">"&lt;f2&gt; o"</span> . 'counsel-describe-symbol)
    (<span style="font-style: italic;">"&lt;f2&gt; l"</span> . 'counsel-find-library)
    (<span style="font-style: italic;">"&lt;f2&gt; t"</span> . 'neo/load-theme)        <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">for now, later we'll have a hydra/transient thing</span>
    (<span style="font-style: italic;">"&lt;f2&gt; u"</span> . 'counsel-unicode-char))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package all-the-icons-ivy-rich
  <span style="font-weight: bold;">:after</span> ivy
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> all-the-icons-ivy-rich-color-icon t)
  (<span style="font-weight: bold;">setq</span> all-the-icons-ivy-rich-icon-size 1.0)
  (<span style="font-weight: bold;">setq</span> all-the-icons-ivy-rich-project t)
  (all-the-icons-ivy-rich-mode 1))
</pre>
</div>



<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package prescient)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ivy-prescient
  <span style="font-weight: bold;">:after</span> counsel
  <span style="font-weight: bold;">:config</span>
  (ivy-prescient-mode 1)
  (prescient-persist-mode 1))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package company
  <span style="font-weight: bold;">:delight</span>
  <span style="font-weight: bold;">:bind</span> (<span style="font-weight: bold;">:map</span> company-active-map
         (<span style="font-style: italic;">"TAB"</span> . company-complexivte-common-or-cycle)
         (<span style="font-style: italic;">"&lt;tab&gt;"</span> . company-complete-common-or-cycle)
         (<span style="font-style: italic;">"&lt;S-Tab&gt;"</span> . company-select-previous)
         (<span style="font-style: italic;">"&lt;backtab&gt;"</span> . company-select-previous)
         (<span style="font-style: italic;">"C-n"</span> . company-select-next)
         (<span style="font-style: italic;">"C-p"</span> . company-select-previous))
  <span style="font-weight: bold;">:hook</span> (after-init . global-company-mode)
  <span style="font-weight: bold;">:custom</span>
  (company-require-match 'never)
  (company-minimum-prefix-length 2)
  (company-tooltip-align-annotations t)
  (company-frontends '(company-pseudo-tooltip-unless-just-one-frontend
                       company-preview-frontend
                       company-echo-metadata-frontend))
  (company-backends '(company-capf company-files))
  (company-tooltip-minimum-width 30)
  (company-tooltip-maximum-width 60))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package company-prescient
  <span style="font-weight: bold;">:after</span> company
  <span style="font-weight: bold;">:config</span>
  (company-prescient-mode 1))
</pre>
</div>
</div>
</div>
