content/neo/neo.org
**** Theme Switching
Emacs doesn't have a hook on theme changes, mainly because it is not
easy to define precisely what a theme switch is. Yet, we have a few
uses for a reasonable approximation, here it is:

#+begin_src emacs-lisp 
   (defvar neo/current-theme 'doom-tomorrow-day "Theme applied")
   (push 'neo/current-theme desktop-globals-to-save)
#+end_src

#+begin_src emacs-lisp
  (defun neo/load-theme ()
    (interactive)
    (ivy-read "Load custom theme: "
              (mapcar 'symbol-name
                      (custom-available-themes))
              :action #'neo/load-theme-internal
              :caller 'neo/load-theme))
  #+end_src

  #+begin_src emacs-lisp
    ;;; need to do something fr powerline nd other modelines
    (defun neo/load-theme-action (x)
    (condition-case nil
        (progn
          (mapc #'disable-theme custom-enabled-themes)
          (load-theme-internal (intern x) t))
      (error "Problem loading theme %s" x)))
#+end_src

#+begin_src emacs-lisp
      (defun neo/update-x-defaults ()
        (with-temp-file "~/.Xdefaults"
          (let ((foreground (face-attribute 'default :foreground))
                (background (face-attribute 'default :background)))
            (insert "emacs.fullscreen: maximized\n")
            (insert (format "emacs.background: %s\n" background))
            (insert (format "emacs.foreground: %s\n" foreground))))
        (call-process-shell-command "xrdb -load ~/.Xdefaults" nil 0))
      
;      (add-hook 'emacs-kill-hook 'neo/update-x-defaults)
#+end_src

#+begin_src emacs-lisp
  (defun neo/load-theme-internal (theme)
    (let ((theme (if (stringp theme) (intern theme) theme)))
      (message "Loading theme %s (disabling others)" theme)
      (mapc #'disable-theme custom-enabled-themes)
      (setq neo/current-theme theme)
      (load-theme theme t)
      (neo/update-x-defaults)
      ;; We should really change the foreground only when org-hide-leading-stars is t.
      ;; For me this is always true
      (set-face-foreground 'org-superstar-leading (face-attribute 'default :background))
      (set-face-foreground 'org-hide (face-attribute 'default :background))))
  
#+end_src

#+begin_src emacs-lisp
  (add-hook 'desktop-after-read-hook (lambda () (neo/load-theme-internal neo/current-theme)))
#+end_src
  
**** Themes

#+begin_src emacs-lisp
  (use-package doom-themes)
#+end_src

#+begin_src emacs-lisp
  (use-package modus-themes)  
#+end_src

#+begin_src emacs-lisp
  (use-package twilight-theme)
#+end_src

#+begin_src emacs-lisp
  (use-package molokai-theme)  
#+end_src

#+begin_src emacs-lisp
  (use-package dracula-theme)  
#+end_src

#+begin_src emacs-lisp
  (use-package blackboard-theme)
#+end_src

#+begin_src emacs-lisp
(use-package monokai-theme)
#+end_src

*** Fonts

#+begin_src emacs-lisp
            ;  (defun neo/get-font-size ()
            ;    "font size is calculated according to the size of the primary screen"
            ;    (let* (;; (command "xrandr | awk '/primary/{print sqrt( ($(nf-2)/10)^2 + ($nf/10)^2 )/2.54}'")
            ;           (command "osascript -e 'tell application \"finder\" to get bounds of window of desktop' | cut -d',' -f3")
            ;           (screen-width (string-to-number (shell-command-to-string command))))  ;;<
            ;      (if (> screen-width 2560) lc/laptop-font-size lc/laptop-font-size))) 
  
            ;  (set-face-attribute 'default nil :font "Fira Code" :height 100 :weight 'light)
            ;  (set-face-attribute 'fixed-pitch nil :font "Fira Code" :height 100 :weight 'light)
            ;  (set-face-attribute 'variable-pitch nil :font "Fira Code" :height 100)
            ;(set-face-attribute 'default nil :font "JetBrainsMono 10")
            ;(set-face-attribute 'default nil :font "Inconsolata")
          ;  (set-default-font "Inconsolata 14")
  
        ;  (use-package fira-code-mode
      ;      :custom (fira-code-mode-disabled-ligatures '("[]" "x")) 
      ;      :hook prog-mode)
  
  (defun neo/set-font-faces ()
    ;; Setting default font
    (set-face-attribute 'default nil
                        :family "JetBrainsMono"
                        :height 110)
  
    ;; Setting fixed pitched font
    (set-face-attribute 'fixed-pitch nil
                        :family "JetBrainsMono"
                        :height 110)
  
    ;; Setting variable pitched font
    (set-face-attribute 'variable-pitch nil
                        :family "Iosevka Aile"
                        :height 120)
    ;; Setting comment face
    (set-face-attribute 'font-lock-comment-face nil
                        :family "Nova Mono"
                        :weight 'regular
                        :height 110))
  
  (neo/set-font-faces)
#+end_src

