neo/neo.html

<div id="outline-container-org89e39e6" class="outline-2">
<h2 id="org89e39e6">User Interface</h2>
<div class="outline-text-2" id="text-org89e39e6">
</div>
<div id="outline-container-orgfffba8b" class="outline-3">
<h3 id="orgfffba8b">Appearance</h3>
<div class="outline-text-3" id="text-orgfffba8b">
</div>
<div id="outline-container-org93543d5" class="outline-4">
<h4 id="org93543d5">Themes</h4>
<div class="outline-text-4" id="text-org93543d5">
</div>
<ul class="org-ul">
<li><a id="orgdbaf610"></a>Theme Switching<br />
<div class="outline-text-5" id="text-orgdbaf610">
<p>
Emacs doesn't have a hook on theme changes, mainly because it is not
easy to define precisely what a theme switch is. Yet, we have a few
uses for a reasonable approximation, here it is:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defvar</span> <span style="font-weight: bold; font-style: italic;">neo/current-theme</span> 'doom-tomorrow-day <span style="font-style: italic;">"Theme applied"</span>)
(<span style="font-weight: bold;">push</span> 'neo/current-theme desktop-globals-to-save)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">neo/load-theme</span> ()
  (<span style="font-weight: bold;">interactive</span>)
  (ivy-read <span style="font-style: italic;">"Load custom theme: "</span>
            (mapcar 'symbol-name
                    (custom-available-themes))
            <span style="font-weight: bold;">:action</span> #'neo/load-theme-internal
            <span style="font-weight: bold;">:caller</span> 'neo/load-theme))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">need to do something fr powerline nd other modelines</span>
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">neo/load-theme-action</span> (x)
(<span style="font-weight: bold;">condition-case</span> nil
    (<span style="font-weight: bold;">progn</span>
      (mapc #'disable-theme custom-enabled-themes)
      (load-theme-internal (intern x) t))
  (<span style="font-weight: bold;">error</span> <span style="font-style: italic;">"Problem loading theme %s"</span> x)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">      (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">neo/update-x-defaults</span> ()
        (<span style="font-weight: bold;">with-temp-file</span> <span style="font-style: italic;">"~/.Xdefaults"</span>
          (<span style="font-weight: bold;">let</span> ((foreground (face-attribute 'default <span style="font-weight: bold;">:foreground</span>))
                (background (face-attribute 'default <span style="font-weight: bold;">:background</span>)))
            (insert <span style="font-style: italic;">"emacs.fullscreen: maximized\n"</span>)
            (insert (format <span style="font-style: italic;">"emacs.background: %s\n"</span> background))
            (insert (format <span style="font-style: italic;">"emacs.foreground: %s\n"</span> foreground))))
        (call-process-shell-command <span style="font-style: italic;">"xrdb -load ~/.Xdefaults"</span> nil 0))

<span style="font-weight: bold; font-style: italic;">;      </span><span style="font-weight: bold; font-style: italic;">(add-hook 'emacs-kill-hook 'neo/update-x-defaults)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">neo/load-theme-internal</span> (theme)
  (<span style="font-weight: bold;">let</span> ((theme (<span style="font-weight: bold;">if</span> (stringp theme) (intern theme) theme)))
    (message <span style="font-style: italic;">"Loading theme %s (disabling others)"</span> theme)
    (mapc #'disable-theme custom-enabled-themes)
    (<span style="font-weight: bold;">setq</span> neo/current-theme theme)
    (load-theme theme t)
    (neo/update-x-defaults)
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">We should really change the foreground only when org-hide-leading-stars is t.</span>
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">For me this is always true</span>
    (set-face-foreground 'org-superstar-leading (face-attribute 'default <span style="font-weight: bold;">:background</span>))
    (set-face-foreground 'org-hide (face-attribute 'default <span style="font-weight: bold;">:background</span>))))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'desktop-after-read-hook (<span style="font-weight: bold;">lambda</span> () (neo/load-theme-internal neo/current-theme)))
</pre>
</div>
</div>
</li>

<li><a id="org9e2683d"></a>Themes<br />
<div class="outline-text-5" id="text-org9e2683d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package doom-themes)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package modus-themes)  
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package twilight-theme)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package molokai-theme)  
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package dracula-theme)  
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package blackboard-theme)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package monokai-theme)
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgbbeb55e" class="outline-4">
<h4 id="orgbbeb55e">Fonts</h4>
<div class="outline-text-4" id="text-orgbbeb55e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">          <span style="font-weight: bold; font-style: italic;">;  </span><span style="font-weight: bold; font-style: italic;">(defun neo/get-font-size ()</span>
          <span style="font-weight: bold; font-style: italic;">;    </span><span style="font-weight: bold; font-style: italic;">"font size is calculated according to the size of the primary screen"</span>
          <span style="font-weight: bold; font-style: italic;">;    </span><span style="font-weight: bold; font-style: italic;">(let* (;; (command "xrandr | awk '/primary/{print sqrt( ($(nf-2)/10)^2 + ($nf/10)^2 )/2.54}'")</span>
          <span style="font-weight: bold; font-style: italic;">;           </span><span style="font-weight: bold; font-style: italic;">(command "osascript -e 'tell application \"finder\" to get bounds of window of desktop' | cut -d',' -f3")</span>
          <span style="font-weight: bold; font-style: italic;">;           </span><span style="font-weight: bold; font-style: italic;">(screen-width (string-to-number (shell-command-to-string command))))  ;;&lt;</span>
          <span style="font-weight: bold; font-style: italic;">;      </span><span style="font-weight: bold; font-style: italic;">(if (&gt; screen-width 2560) lc/laptop-font-size lc/laptop-font-size))) </span>

          <span style="font-weight: bold; font-style: italic;">;  </span><span style="font-weight: bold; font-style: italic;">(set-face-attribute 'default nil :font "Fira Code" :height 100 :weight 'light)</span>
          <span style="font-weight: bold; font-style: italic;">;  </span><span style="font-weight: bold; font-style: italic;">(set-face-attribute 'fixed-pitch nil :font "Fira Code" :height 100 :weight 'light)</span>
          <span style="font-weight: bold; font-style: italic;">;  </span><span style="font-weight: bold; font-style: italic;">(set-face-attribute 'variable-pitch nil :font "Fira Code" :height 100)</span>
          <span style="font-weight: bold; font-style: italic;">;</span><span style="font-weight: bold; font-style: italic;">(set-face-attribute 'default nil :font "JetBrainsMono 10")</span>
          <span style="font-weight: bold; font-style: italic;">;</span><span style="font-weight: bold; font-style: italic;">(set-face-attribute 'default nil :font "Inconsolata")</span>
        <span style="font-weight: bold; font-style: italic;">;  </span><span style="font-weight: bold; font-style: italic;">(set-default-font "Inconsolata 14")</span>

      <span style="font-weight: bold; font-style: italic;">;  </span><span style="font-weight: bold; font-style: italic;">(use-package fira-code-mode</span>
    <span style="font-weight: bold; font-style: italic;">;      </span><span style="font-weight: bold; font-style: italic;">:custom (fira-code-mode-disabled-ligatures '("[]" "x")) </span>
    <span style="font-weight: bold; font-style: italic;">;      </span><span style="font-weight: bold; font-style: italic;">:hook prog-mode)</span>

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">neo/set-font-faces</span> ()
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Setting default font</span>
  (set-face-attribute 'default nil
                      <span style="font-weight: bold;">:family</span> <span style="font-style: italic;">"JetBrainsMono"</span>
                      <span style="font-weight: bold;">:height</span> 110)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Setting fixed pitched font</span>
  (set-face-attribute 'fixed-pitch nil
                      <span style="font-weight: bold;">:family</span> <span style="font-style: italic;">"JetBrainsMono"</span>
                      <span style="font-weight: bold;">:height</span> 110)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Setting variable pitched font</span>
  (set-face-attribute 'variable-pitch nil
                      <span style="font-weight: bold;">:family</span> <span style="font-style: italic;">"Iosevka Aile"</span>
                      <span style="font-weight: bold;">:height</span> 120)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Setting comment face</span>
  (set-face-attribute 'font-lock-comment-face nil
                      <span style="font-weight: bold;">:family</span> <span style="font-style: italic;">"Nova Mono"</span>
                      <span style="font-weight: bold;">:weight</span> 'regular
                      <span style="font-weight: bold;">:height</span> 110))

(neo/set-font-faces)
</pre>
</div>
</div>
</div>
