content/neo/neo.org
*** Windows
Allocate windows space.
I don't know I like this (with more than 2 windows) and it might
interfere with shackle and other ways we'll contol positioning of
buffers.

#+begin_src emacs-lisp
  (use-package golden-ratio
    :config
    (golden-ratio-mode 1))
#+end_src
*** Modeline

For now we take the easy path and install ~doom-modeline~. But there're
interesting developements in SVG support to keep an eye on.

#+BEGIN_SRC emacs-lisp
(use-package doom-modeline
  :init (doom-modeline-mode 1))
#+END_SRC

minions-mode should add a menu with minor modes in the modeline. I
don't see anyhing, though. Maybe remove it
#+begin_src emacs-lisp
(use-package minions
  :hook (doom-modeline-mode . minions-mode))
#+end_src

*** Icons
#+begin_src emacs-lisp
  (defun neo/maybe-install-fonts ()
    (let ((font-dir (concat (or (getenv "XDG_DATA_HOME")
                                (expand-file-name "~/.local/share"))
                                 "/fonts/")))
      (unless (file-exists-p (concat font-dir "all-the-icons.ttf"))
        (all-the-icons-install-fonts t))))
#+end_src

#+begin_src emacs-lisp
; should we use the after-init hook?
  (use-package all-the-icons :config (neo/maybe-install-fonts))
#+end_src

*** Parenthesis
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :init
    (progn
      (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)))
#+end_src

*** Eyecandies
#+begin_src emacs-lisp
(use-package hl-todo
  :hook ((prog-mode) . lc/hl-todo-init)
  :init
  (defun lc/hl-todo-init ()
    (setq-local hl-todo-keyword-faces '(("HOLD" . "#cfdf30")
                                        ("TODO" . "#ff9977")
                                        ("NEXT" . "#b6a0ff")
                                        ("PROG" . "#00d3d0")
                                        ("FIXME" . "#ff9977")
                                        ("DONE" . "#44bc44")
                                        ("REVIEW" . "#6ae4b9")
                                        ("DEPRECATED" . "#bfd9ff")))
    (hl-todo-mode))
  )
#+end_src

#+begin_src emacs-lisp
  (use-package rainbow-mode
    :config
    (rainbow-mode))  
#+end_src

Not sure if the following is slowing down Emacs. I need to take a look
at the implementation. It looks cool and is useful.
#+begin_src emacs-lisp
  (use-package beacon
    :config
    (beacon-mode 1)
    ;; TODO make this theme dependent
    (setq beacon-color "#50D050") ;; a light green
   )
#+end_src

#+begin_src emacs-lisp
(use-package ansi-color)
#+end_src

** Keybindings
*** Memory Aids
There are a few keybindings in Emacs. Some are useful, and you won't
remember them when needed.

At times one remembers the beginning of a keybinding. ~which-key~ comes
to the rescue and after a short delay shows all possible ways to
extend that prefix. Not as precise as curated hydras, but has the big
advantage of applying to all key bindings without further
configuration.

#+BEGIN_SRC emacs-lisp
(use-package which-key
  :init (which-key-mode)
  :delight which-key-mode
  :config
  (setq which-key-idle-delay 0.3))
#+END_SRC

And remember the
~describe-personal-keybindings~
(~~<f2> k~~) that comes with ~use-package~.

*** Global Keybindings

#+BEGIN_SRC emacs-lisp
  (use-package key-chord
    :config
    (key-chord-define-global "``"     'toggle-menu-bar-mode-from-frame)
    (key-chord-define-global ".."     'comment-region)
    (key-chord-define-global ",,"     'sort-lines)
    (key-chord-define-global "//"     'align-regexp))
#+END_SRC

#+begin_src emacs-lisp
  (global-set-key "\M- " 'hippie-expand)
;  (global-set-key "\M- " 'company-complete-common)
#+end_src
* Movement
When more than two windows are displayed and you press ~C-x o~  (normally bound to ~other-window~)
~ace-window~ overlays a number in each window so that you can quickly
navigate to the desired target window. And then we give ourselves a
chord, so that ~''~ can be used to switch window.

#+begin_src emacs-lisp 
  (use-package ace-window
    :bind
    ("C-x o" . ace-window)
    :chords
    (("''" . ace-window))
    :custom-face
    ;; foreground should be computed from current theme, preserved the same way across restarts and
    ;; restored.
    (aw-leading-char-face ((t (:inherit ace-jump-face-foreground
                                        :font "FasterOne" :height 2.5 :foreground "dark gray" )))))
  
  (add-to-list 'golden-ratio-extra-commands 'ace-window)
#+end_src

* Undo
Friends don't let friends use Emacs' builtin undo.

#+BEGIN_SRC emacs-lisp
  (use-package undo-tree
    :delight undo-tree-mode
    :chords (("uu" . undo-tree-visualize))
    :init (global-undo-tree-mode)
    (setq undo-tree-visualizer-diff t)
    (setq undo-tree-visualizer-timestamps t))
#+END_SRC

* Software Development

** Version Control

