neo/neo.html

<div id="outline-container-orgd32ed78" class="outline-4">
<h4 id="orgd32ed78">Windows</h4>
<div class="outline-text-4" id="text-orgd32ed78">
<p>
Allocate windows space.
I don't know I like this (with more than 2 windows) and it might
interfere with shackle and other ways we'll contol positioning of
buffers.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package golden-ratio
  <span style="font-weight: bold;">:config</span>
  (golden-ratio-mode 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-org098d99d" class="outline-4">
<h4 id="org098d99d">Modeline</h4>
<div class="outline-text-4" id="text-org098d99d">
<p>
For now we take the easy path and install <code>doom-modeline</code>. But there're
interesting developements in SVG support to keep an eye on.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package doom-modeline
  <span style="font-weight: bold;">:init</span> (doom-modeline-mode 1))
</pre>
</div>

<p>
minions-mode should add a menu with minor modes in the modeline. I
don't see anyhing, though. Maybe remove it
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package minions
  <span style="font-weight: bold;">:hook</span> (doom-modeline-mode . minions-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org55f8ddd" class="outline-4">
<h4 id="org55f8ddd">Icons</h4>
<div class="outline-text-4" id="text-org55f8ddd">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">neo/maybe-install-fonts</span> ()
  (<span style="font-weight: bold;">let</span> ((font-dir (concat (<span style="font-weight: bold;">or</span> (getenv <span style="font-style: italic;">"XDG_DATA_HOME"</span>)
                              (expand-file-name <span style="font-style: italic;">"~/.local/share"</span>))
                               <span style="font-style: italic;">"/fonts/"</span>)))
    (<span style="font-weight: bold;">unless</span> (file-exists-p (concat font-dir <span style="font-style: italic;">"all-the-icons.ttf"</span>))
      (all-the-icons-install-fonts t))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">should we use the after-init hook?</span>
  (use-package all-the-icons <span style="font-weight: bold;">:config</span> (neo/maybe-install-fonts))
</pre>
</div>
</div>
</div>

<div id="outline-container-org512b600" class="outline-4">
<h4 id="org512b600">Parenthesis</h4>
<div class="outline-text-4" id="text-org512b600">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package rainbow-delimiters
  <span style="font-weight: bold;">:init</span>
  (<span style="font-weight: bold;">progn</span>
    (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc07a62b" class="outline-4">
<h4 id="orgc07a62b">Eyecandies</h4>
<div class="outline-text-4" id="text-orgc07a62b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package hl-todo
  <span style="font-weight: bold;">:hook</span> ((prog-mode) . lc/hl-todo-init)
  <span style="font-weight: bold;">:init</span>
  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">lc/hl-todo-init</span> ()
    (<span style="font-weight: bold;">setq-local</span> hl-todo-keyword-faces '((<span style="font-style: italic;">"HOLD"</span> . <span style="font-style: italic;">"#cfdf30"</span>)
                                        (<span style="font-style: italic;">"TODO"</span> . <span style="font-style: italic;">"#ff9977"</span>)
                                        (<span style="font-style: italic;">"NEXT"</span> . <span style="font-style: italic;">"#b6a0ff"</span>)
                                        (<span style="font-style: italic;">"PROG"</span> . <span style="font-style: italic;">"#00d3d0"</span>)
                                        (<span style="font-style: italic;">"FIXME"</span> . <span style="font-style: italic;">"#ff9977"</span>)
                                        (<span style="font-style: italic;">"DONE"</span> . <span style="font-style: italic;">"#44bc44"</span>)
                                        (<span style="font-style: italic;">"REVIEW"</span> . <span style="font-style: italic;">"#6ae4b9"</span>)
                                        (<span style="font-style: italic;">"DEPRECATED"</span> . <span style="font-style: italic;">"#bfd9ff"</span>)))
    (hl-todo-mode))
  )
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package rainbow-mode
  <span style="font-weight: bold;">:config</span>
  (rainbow-mode))  
</pre>
</div>

<p>
Not sure if the following is slowing down Emacs. I need to take a look
at the implementation. It looks cool and is useful.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package beacon
  <span style="font-weight: bold;">:config</span>
  (beacon-mode 1)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">TODO make this theme dependent</span>
  (<span style="font-weight: bold;">setq</span> beacon-color <span style="font-style: italic;">"#50D050"</span>) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">a light green</span>
 )
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ansi-color)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga471e13" class="outline-3">
<h3 id="orga471e13">Keybindings</h3>
<div class="outline-text-3" id="text-orga471e13">
</div>
<div id="outline-container-org1ce995e" class="outline-4">
<h4 id="org1ce995e">Memory Aids</h4>
<div class="outline-text-4" id="text-org1ce995e">
<p>
There are a few keybindings in Emacs. Some are useful, and you won't
remember them when needed.
</p>

<p>
At times one remembers the beginning of a keybinding. <code>which-key</code> comes
to the rescue and after a short delay shows all possible ways to
extend that prefix. Not as precise as curated hydras, but has the big
advantage of applying to all key bindings without further
configuration.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package which-key
  <span style="font-weight: bold;">:init</span> (which-key-mode)
  <span style="font-weight: bold;">:delight</span> which-key-mode
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> which-key-idle-delay 0.3))
</pre>
</div>

<p>
And remember the
<code>describe-personal-keybindings</code>
(<code>~&lt;f2&gt; k~</code>) that comes with <code>use-package</code>.
</p>
</div>
</div>

<div id="outline-container-org68c1526" class="outline-4">
<h4 id="org68c1526">Global Keybindings</h4>
<div class="outline-text-4" id="text-org68c1526">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package key-chord
  <span style="font-weight: bold;">:config</span>
  (key-chord-define-global <span style="font-style: italic;">"``"</span>     'toggle-menu-bar-mode-from-frame)
  (key-chord-define-global <span style="font-style: italic;">".."</span>     'comment-region)
  (key-chord-define-global <span style="font-style: italic;">",,"</span>     'sort-lines)
  (key-chord-define-global <span style="font-style: italic;">"//"</span>     'align-regexp))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  (global-set-key <span style="font-style: italic;">"\M- "</span> 'hippie-expand)
<span style="font-weight: bold; font-style: italic;">;  </span><span style="font-weight: bold; font-style: italic;">(global-set-key "\M- " 'company-complete-common)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org873a11b" class="outline-2">
<h2 id="org873a11b">Movement</h2>
<div class="outline-text-2" id="text-org873a11b">
<p>
When more than two windows are displayed and you press <code>C-x o</code>  (normally bound to <code>other-window</code>)
<code>ace-window</code> overlays a number in each window so that you can quickly
navigate to the desired target window. And then we give ourselves a
chord, so that <code>''</code> can be used to switch window.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ace-window
  <span style="font-weight: bold;">:bind</span>
  (<span style="font-style: italic;">"C-x o"</span> . ace-window)
  <span style="font-weight: bold;">:chords</span>
  ((<span style="font-style: italic;">"''"</span> . ace-window))
  <span style="font-weight: bold;">:custom-face</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">foreground should be computed from current theme, preserved the same way across restarts and</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">restored.</span>
  (aw-leading-char-face ((t (<span style="font-weight: bold;">:inherit</span> ace-jump-face-foreground
                                      <span style="font-weight: bold;">:font</span> <span style="font-style: italic;">"FasterOne"</span> <span style="font-weight: bold;">:height</span> 2.5 <span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"dark gray"</span> )))))

(add-to-list 'golden-ratio-extra-commands 'ace-window)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6bc524f" class="outline-2">
<h2 id="org6bc524f">Undo</h2>
<div class="outline-text-2" id="text-org6bc524f">
<p>
Friends don't let friends use Emacs' builtin undo.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package undo-tree
  <span style="font-weight: bold;">:delight</span> undo-tree-mode
  <span style="font-weight: bold;">:chords</span> ((<span style="font-style: italic;">"uu"</span> . undo-tree-visualize))
  <span style="font-weight: bold;">:init</span> (global-undo-tree-mode)
  (<span style="font-weight: bold;">setq</span> undo-tree-visualizer-diff t)
  (<span style="font-weight: bold;">setq</span> undo-tree-visualizer-timestamps t))
</pre>
</div>
</div>
</div>

<div id="outline-container-org02c251b" class="outline-2">
<h2 id="org02c251b">Software Development</h2>
<div class="outline-text-2" id="text-org02c251b">
</div>
