content/neo/neo.org
*** Git

#+begin_src emacs-lisp
(use-package git-timemachine :bind ("<f12> t" . 'git-timemachine))
#+end_src

#+begin_src emacs-lisp
;  (use-package git-gutter+
;    :config (global-git-gutter+-mode))
#+end_src

#+begin_src emacs-lisp
  (use-package git-gutter-fringe+) ; :after git-gutter+)
#+end_src

#+begin_src emacs-lisp
  (use-package dired-git-info
    :bind (:map dired-mode-map
           (")" . dired-git-info-mode)))
#+end_src


*** Magit
I use magit for interacting with git repositories. And I'm forcing
myself to use the command line git as little as possible.
#+begin_src emacs-lisp
  (use-package magit
    :config
    (setq magit-save-repository-buffers 'dontask)
    :custom
    (magit-list-refs-sortby "-creatordate") ; doesn't seem to have any effect
    (magit-refs-show-commit-count 'branch) ; may be too expensive
    ; TODO: this should be the default behavior of magit-builtin-completing-read
    ; when ivy is enabed gobally. But I am not sure of what is the actual situation.
    (magit-completing-read-function 'ivy-completing-read)
    :init
    ;; NOTE: order of functions in this hook is important, we make this clear with setq
    ;; instead of gambling with add-hook. There's magit-add-section-hook that might be better.
    ;; TODO: find the right place for magit-insert-branch-description (might also be
    ;; useful in magit-refs-sections-hook)
    (setq magit-status-sections-hook
	  '(magit-insert-status-headers
	    magit-insert-merge-log
	    magit-insert-rebase-sequence
	    magit-insert-am-sequence
	    magit-insert-sequencer-sequence
	    magit-insert-bisect-output
	    magit-insert-bisect-rest
	    magit-insert-bisect-log
	    magit-insert-untracked-files
	    magit-insert-unstaged-changes
	    magit-insert-staged-changes
	    magit-insert-stashes
	    magit-insert-unpushed-to-pushremote
	    magit-insert-unpushed-to-upstream-or-recent
	    magit-insert-unpulled-from-pushremote
	    magit-insert-unpulled-from-upstream
	    magit-insert-local-branches))
    :bind
    ("<f12> s" . 'magit-status)
    ("<f12> g" . 'counsel-git-grep))
#+end_src

Forge allows to interact with GitHub (and similar deployments, git lab
(soon) git ea etc). This for actions like pull requests and issues.
#+begin_src emacs-lisp
(use-package forge :after magit)
#+end_src


** Build Systems

Doesn't seem to do any coloring.

#+begin_src emacs-lisp :tangle no
(defun endless/colorize-compilation ()
  "Colorize from `compilation-filter-start' to `point'."
  (let ((inhibit-read-only t))
    (ansi-color-apply-on-region
     compilation-filter-start (point))))

(add-hook 'compilation-filter-hook
          #'endless/colorize-compilation)
#+end_src
** Linters
** Languages
*** Emacs Lisp

In eliasp mode, expanding macros is often an important complement to documentation.
#+begin_src emacs-lisp
  (use-package macrostep
  :bind (:map  emacs-lisp-mode-map (("C-c e" . macrostep-expand))))
#+end_src

Paredit is useful for editing lisp code. If you do it often enough to
remember the relative keybinding.

#+begin_src emacs-lisp
  (use-package lispy
    :init
    (add-hook 'emacs-lisp-mode-hook (lambda () (lispy-mode 1))))
#+end_src

Looks like ~lispy~ and ~paredit~ can coexist. We'll see.

#+begin_src emacs-lisp #:tangle no
(use-package paredit
  :init
  (add-hook 'emacs-lisp-mode-hook #'enable-paredit-mode)
  (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
  (add-hook 'lisp-mode-hook #'enable-paredit-mode)
  (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
  (add-hook 'scheme-mode-hook #'enable-paredit-mode)
  :config
  (show-paren-mode t)
  :bind (("M-[" . paredit-wrap-square)
         ("M-{" . paredit-wrap-curly))
  :delight)
#+end_src


#+begin_src emacs-lisp :tangle no
;  (use-package el-fly-indent-mode
;    :hook
;    ((emacs-lisp-mode . el-fly-indent-mode)))
#+end_src
  
Bug Hunter bisects elisp files for you. You can thank me later :smile:
  
#+begin_src emacs-lisp
    (use-package bug-hunter)
#+end_src

*** Python
*** C++
*** Haskell
*** Shell
*** Markdown
#+begin_src emacs-lisp
(use-package markdown-mode)
#+end_src
*** Bazel

#+begin_src emacs-lisp
(use-package bazel)
#+end_src

*** TeX

#+begin_src emacs-lisp
      (setq straight-recipes-gnu-elpa-use-mirror t)
      (straight-use-package 'auctex)
      (use-package latex-preview-pane
        :custom
        (pdf-latex-command "xelatex"))

      (latex-preview-pane-enable)
      (add-hook 'LaTeX-mode-hook 'latex-preview-pane-mode)
;      (TeX-engine-set 'xetex)
#+end_src

* Applications
