neo/neo.html
<div id="outline-container-org32a1fa2" class="outline-3">
<h3 id="org32a1fa2">Version Control</h3>
<div class="outline-text-3" id="text-org32a1fa2">
</div>
<div id="outline-container-orgb62a244" class="outline-4">
<h4 id="orgb62a244">Git</h4>
<div class="outline-text-4" id="text-orgb62a244">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package git-timemachine <span style="font-weight: bold;">:bind</span> (<span style="font-style: italic;">"&lt;f12&gt; t"</span> . 'git-timemachine))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="font-weight: bold; font-style: italic;">;  </span><span style="font-weight: bold; font-style: italic;">(use-package git-gutter+</span>
<span style="font-weight: bold; font-style: italic;">;    </span><span style="font-weight: bold; font-style: italic;">:config (global-git-gutter+-mode))</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package git-gutter-fringe+) <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">:after git-gutter+)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package dired-git-info
  <span style="font-weight: bold;">:bind</span> (<span style="font-weight: bold;">:map</span> dired-mode-map
         (<span style="font-style: italic;">")"</span> . dired-git-info-mode)))
</pre>
</div>
</div>
</div>


<div id="outline-container-org33d9451" class="outline-4">
<h4 id="org33d9451">Magit</h4>
<div class="outline-text-4" id="text-org33d9451">
<p>
I use magit for interacting with git repositories. And I'm forcing
myself to use the command line git as little as possible.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package magit
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> magit-save-repository-buffers 'dontask)
  <span style="font-weight: bold;">:custom</span>
  (magit-list-refs-sortby <span style="font-style: italic;">"-creatordate"</span>) <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">doesn't seem to have any effect</span>
  (magit-refs-show-commit-count 'branch) <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">may be too expensive</span>
  <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">TODO: this should be the default behavior of magit-builtin-completing-read</span>
  <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">when ivy is enabed gobally. But I am not sure of what is the actual situation.</span>
  (magit-completing-read-function 'ivy-completing-read)
  <span style="font-weight: bold;">:init</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">NOTE: order of functions in this hook is important, we make this clear with setq</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">instead of gambling with add-hook. There's magit-add-section-hook that might be better.</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">TODO: find the right place for magit-insert-branch-description (might also be</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">useful in magit-refs-sections-hook)</span>
  (<span style="font-weight: bold;">setq</span> magit-status-sections-hook
        '(magit-insert-status-headers
          magit-insert-merge-log
          magit-insert-rebase-sequence
          magit-insert-am-sequence
          magit-insert-sequencer-sequence
          magit-insert-bisect-output
          magit-insert-bisect-rest
          magit-insert-bisect-log
          magit-insert-untracked-files
          magit-insert-unstaged-changes
          magit-insert-staged-changes
          magit-insert-stashes
          magit-insert-unpushed-to-pushremote
          magit-insert-unpushed-to-upstream-or-recent
          magit-insert-unpulled-from-pushremote
          magit-insert-unpulled-from-upstream
          magit-insert-local-branches))
  <span style="font-weight: bold;">:bind</span>
  (<span style="font-style: italic;">"&lt;f12&gt; s"</span> . 'magit-status)
  (<span style="font-style: italic;">"&lt;f12&gt; g"</span> . 'counsel-git-grep))
</pre>
</div>

<p>
Forge allows to interact with GitHub (and similar deployments, git lab
(soon) git ea etc). This for actions like pull requests and issues.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package forge <span style="font-weight: bold;">:after</span> magit)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgf4861a5" class="outline-3">
<h3 id="orgf4861a5">Build Systems</h3>
<div class="outline-text-3" id="text-orgf4861a5">
<p>
Doesn't seem to do any coloring.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">endless/colorize-compilation</span> ()
  <span style="font-style: italic;">"Colorize from `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">compilation-filter-start</span><span style="font-style: italic;">' to `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">point</span><span style="font-style: italic;">'."</span>
  (<span style="font-weight: bold;">let</span> ((inhibit-read-only t))
    (ansi-color-apply-on-region
     compilation-filter-start (point))))

(add-hook 'compilation-filter-hook
          #'endless/colorize-compilation)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcdb6fbd" class="outline-3">
<h3 id="orgcdb6fbd">Linters</h3>
</div>
<div id="outline-container-org814e7d7" class="outline-3">
<h3 id="org814e7d7">Languages</h3>
<div class="outline-text-3" id="text-org814e7d7">
</div>
<div id="outline-container-org1c97669" class="outline-4">
<h4 id="org1c97669">Emacs Lisp</h4>
<div class="outline-text-4" id="text-org1c97669">
<p>
In eliasp mode, expanding macros is often an important complement to documentation.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package macrostep
<span style="font-weight: bold;">:bind</span> (<span style="font-weight: bold;">:map</span>  emacs-lisp-mode-map ((<span style="font-style: italic;">"C-c e"</span> . macrostep-expand))))
</pre>
</div>

<p>
Paredit is useful for editing lisp code. If you do it often enough to
remember the relative keybinding.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package lispy
  <span style="font-weight: bold;">:init</span>
  (add-hook 'emacs-lisp-mode-hook (<span style="font-weight: bold;">lambda</span> () (lispy-mode 1))))
</pre>
</div>

<p>
Looks like <code>lispy</code> and <code>paredit</code> can coexist. We'll see.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package paredit
  <span style="font-weight: bold;">:init</span>
  (add-hook 'emacs-lisp-mode-hook #'enable-paredit-mode)
  (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
  (add-hook 'lisp-mode-hook #'enable-paredit-mode)
  (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
  (add-hook 'scheme-mode-hook #'enable-paredit-mode)
  <span style="font-weight: bold;">:config</span>
  (show-paren-mode t)
  <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"M-["</span> . paredit-wrap-square)
         (<span style="font-style: italic;">"M-{"</span> . paredit-wrap-curly))
  <span style="font-weight: bold;">:delight</span>)
</pre>
</div>


<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="font-weight: bold; font-style: italic;">;  </span><span style="font-weight: bold; font-style: italic;">(use-package el-fly-indent-mode</span>
<span style="font-weight: bold; font-style: italic;">;    </span><span style="font-weight: bold; font-style: italic;">:hook</span>
<span style="font-weight: bold; font-style: italic;">;    </span><span style="font-weight: bold; font-style: italic;">((emacs-lisp-mode . el-fly-indent-mode)))</span>
</pre>
</div>

<p>
Bug Hunter bisects elisp files for you. You can thank me later :smile:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package bug-hunter)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge55ea1d" class="outline-4">
<h4 id="orge55ea1d">Python</h4>
</div>
<div id="outline-container-orgb45020e" class="outline-4">
<h4 id="orgb45020e">C++</h4>
</div>
<div id="outline-container-org60c123b" class="outline-4">
<h4 id="org60c123b">Haskell</h4>
</div>
<div id="outline-container-orgf62622c" class="outline-4">
<h4 id="orgf62622c">Shell</h4>
</div>
<div id="outline-container-org66ee019" class="outline-4">
<h4 id="org66ee019">Markdown</h4>
<div class="outline-text-4" id="text-org66ee019">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package markdown-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-org30f2c9a" class="outline-4">
<h4 id="org30f2c9a">Bazel</h4>
<div class="outline-text-4" id="text-org30f2c9a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package bazel)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgde62176" class="outline-4">
<h4 id="orgde62176">TeX</h4>
<div class="outline-text-4" id="text-orgde62176">
<div class="org-src-container">
<pre class="src src-emacs-lisp">      (<span style="font-weight: bold;">setq</span> straight-recipes-gnu-elpa-use-mirror t)
      (straight-use-package 'auctex)
      (use-package latex-preview-pane
        <span style="font-weight: bold;">:custom</span>
        (pdf-latex-command <span style="font-style: italic;">"xelatex"</span>))

      (latex-preview-pane-enable)
      (add-hook 'LaTeX-mode-hook 'latex-preview-pane-mode)
<span style="font-weight: bold; font-style: italic;">;      </span><span style="font-weight: bold; font-style: italic;">(TeX-engine-set 'xetex)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
