content/neo/neo.org
** Org Mode

I install the org-mode package very early in the init process because
I want to use a newer version than what comes with Emacs.

#+begin_src emacs-lisp
  (use-package org
    :custom
    (org-hide-emphasis-markers t)
    (org-hide-leading-stars t)
    :config
    (add-to-list 'ispell-skip-region-alist '(":\\(PROPERTIES\\|LOGBOOK\\):" . ":END:"))
    (add-to-list 'ispell-skip-region-alist '("#\\+BEGIN_SRC" . "#\\+END_SRC"))
    (add-to-list 'ispell-skip-region-alist '("#\\+BEGIN_EXAMPLE" . "#\\+END_EXAMPLE"))
    (setq org-html-htmlize-output-type 'css)
    :hook
    (org-mode . neo/org-mode-setup))
#+end_src

#+begin_src emacs-lisp
  (defun neo/org-mode-setup ()
    (neo/org-mode-prettify)
    (setq org-startup-indented t)
    (setq org-src-tab-acts-natively t)
    (org-indent-mode)
    (auto-fill-mode 1))
#+end_src

#+begin_src emacs-lisp
  (defun neo/org-mode-prettify ()
    (setq-default prettify-symbols-alist '(("#+BEGIN_SRC" . "†")
					   ("#+END_SRC" . "†")
					   ("#+begin_src" . "†")
					   ("#+end_src" . "†")
					   ("#+BEGIN_EXAMPLE" . (?ℰ (Br . Bl) ?⇒)) ;; ℰ⇒
					   ("#+END_EXAMPLE"    . ?⇐)               ;; ⇐
					   ("#+begin_example" . (?ℰ (Br . Bl) ?⇒)) ;; ℰ⇒
					   ("#+end_example"    . ?⇐)               ;; ⇐
					   ("#+BEGIN_QUOTE" . (?𝒬 (Br . Bl) ?⇒))   ;; 𝒬⇒
					   ("#+END_QUOTE"    . ?⇐)                 ;; ⇐
					   ("#+begin_quote" . (?𝒬 (Br . Bl) ?⇒))   ;; 𝒬⇒
					   ("#+end_quote"    . ?⇐)                 ;; ⇐
					   ("[ ]" .  "☐") 
					   ("[X]" . "☑" ) 
					   ("[-]" . "❍" ) 
					   ("<=" . ?≤)
					   (">=" . "≥")
					   ("=>" . "⇨")))
    (setq prettify-symbols-unprettify-at-point 'right-edge)
    ;; TODO there's a better way to enable this
    (prettify-symbols-mode))
#+end_src

#+begin_src emacs-lisp
  (use-package org-tempo
    :straight nil				; part of org
    :after org
    :config
    (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("go" . "src go"))
    (add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
    (add-to-list 'org-structure-template-alist '("json" . "src json")))
#+end_src

#+begin_src emacs-lisp
  (use-package org-make-toc
    :hook (org-mode . org-make-toc-mode))

  (add-hook 'org-mode-hook #'org-make-toc-mode)
#+end_src

#+begin_src emacs-lisp
(use-package org-appear
  :hook (org-mode . org-appear-mode))
#+end_src
*** Beautification

#+begin_src emacs-lisp
  (use-package org-superstar
    :custom
    (org-superstar-special-todo-items t)
    ;; not sure which setting of ~org-superstar-remove-leading-star~ I like the most
    (org-superstar-remove-leading-stars nil)
    :config
    (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))
    ;; (setq org-superstar-headline-bullets-list '("☰" "☷" "☵" "☲"  "☳" "☴"  "☶"  "☱" ))
    ;; (setq org-superstar-headline-bullets-list '("✖" "✚" "◉" "○" "▶"))
    (setq org-superstar-headline-bullets-list '("◆"))
    (setq org-superstar-cycle-headline-bullets nil)
    (setq org-ellipsis " ↴ ")
    ;; TODO this is something that should be done at every theme switch.
    ;; we should have some form of hooks where we also generate a ~/.Xdefaults
    (set-face-foreground 'org-superstar-leading (face-attribute 'default :background))
    (set-face-foreground 'org-hide (face-attribute 'default :background)))
#+end_src

*** Applications
