neo/neo.html

<div id="outline-container-org9961409" class="outline-2">
<h2 id="org9961409">Applications</h2>
<div class="outline-text-2" id="text-org9961409">
</div>
<div id="outline-container-orgebb9553" class="outline-3">
<h3 id="orgebb9553">Org Mode</h3>
<div class="outline-text-3" id="text-orgebb9553">
<p>
I install the org-mode package very early in the init process because
I want to use a newer version than what comes with Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org
  <span style="font-weight: bold;">:custom</span>
  (org-hide-emphasis-markers t)
  (org-hide-leading-stars t)
  <span style="font-weight: bold;">:config</span>
  (add-to-list 'ispell-skip-region-alist '(<span style="font-style: italic;">":</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">(</span><span style="font-style: italic;">PROPERTIES</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">LOGBOOK</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">)</span><span style="font-style: italic;">:"</span> . <span style="font-style: italic;">":END:"</span>))
  (add-to-list 'ispell-skip-region-alist '(<span style="font-style: italic;">"#\\+BEGIN_SRC"</span> . <span style="font-style: italic;">"#\\+END_SRC"</span>))
  (add-to-list 'ispell-skip-region-alist '(<span style="font-style: italic;">"#\\+BEGIN_EXAMPLE"</span> . <span style="font-style: italic;">"#\\+END_EXAMPLE"</span>))
  (<span style="font-weight: bold;">setq</span> org-html-htmlize-output-type 'css)
  <span style="font-weight: bold;">:hook</span>
  (org-mode . neo/org-mode-setup))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">neo/org-mode-setup</span> ()
  (neo/org-mode-prettify)
  (<span style="font-weight: bold;">setq</span> org-startup-indented t)
  (<span style="font-weight: bold;">setq</span> org-src-tab-acts-natively t)
  (org-indent-mode)
  (auto-fill-mode 1))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">neo/org-mode-prettify</span> ()
  (<span style="font-weight: bold;">setq-default</span> prettify-symbols-alist '((<span style="font-style: italic;">"#+BEGIN_SRC"</span> . <span style="font-style: italic;">"&#8224;"</span>)
                                         (<span style="font-style: italic;">"#+END_SRC"</span> . <span style="font-style: italic;">"&#8224;"</span>)
                                         (<span style="font-style: italic;">"#+begin_src"</span> . <span style="font-style: italic;">"&#8224;"</span>)
                                         (<span style="font-style: italic;">"#+end_src"</span> . <span style="font-style: italic;">"&#8224;"</span>)
                                         (<span style="font-style: italic;">"#+BEGIN_EXAMPLE"</span> . (?&#8496; (Br . Bl) ?&#8658;)) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">&#8496;&#8658;</span>
                                         (<span style="font-style: italic;">"#+END_EXAMPLE"</span>    . ?&#8656;)               <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">&#8656;</span>
                                         (<span style="font-style: italic;">"#+begin_example"</span> . (?&#8496; (Br . Bl) ?&#8658;)) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">&#8496;&#8658;</span>
                                         (<span style="font-style: italic;">"#+end_example"</span>    . ?&#8656;)               <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">&#8656;</span>
                                         (<span style="font-style: italic;">"#+BEGIN_QUOTE"</span> . (?&#119980; (Br . Bl) ?&#8658;))   <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">&#119980;&#8658;</span>
                                         (<span style="font-style: italic;">"#+END_QUOTE"</span>    . ?&#8656;)                 <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">&#8656;</span>
                                         (<span style="font-style: italic;">"#+begin_quote"</span> . (?&#119980; (Br . Bl) ?&#8658;))   <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">&#119980;&#8658;</span>
                                         (<span style="font-style: italic;">"#+end_quote"</span>    . ?&#8656;)                 <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">&#8656;</span>
                                         (<span style="font-style: italic;">"[ ]"</span> .  <span style="font-style: italic;">"&#9744;"</span>) 
                                         (<span style="font-style: italic;">"[X]"</span> . <span style="font-style: italic;">"&#9745;"</span> ) 
                                         (<span style="font-style: italic;">"[-]"</span> . <span style="font-style: italic;">"&#10061;"</span> ) 
                                         (<span style="font-style: italic;">"&lt;="</span> . ?&#8804;)
                                         (<span style="font-style: italic;">"&gt;="</span> . <span style="font-style: italic;">"&#8805;"</span>)
                                         (<span style="font-style: italic;">"=&gt;"</span> . <span style="font-style: italic;">"&#8680;"</span>)))
  (<span style="font-weight: bold;">setq</span> prettify-symbols-unprettify-at-point 'right-edge)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">TODO there's a better way to enable this</span>
  (prettify-symbols-mode))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-tempo
  <span style="font-weight: bold;">:straight</span> nil                         <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">part of org</span>
  <span style="font-weight: bold;">:after</span> org
  <span style="font-weight: bold;">:config</span>
  (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"sh"</span> . <span style="font-style: italic;">"src sh"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"el"</span> . <span style="font-style: italic;">"src emacs-lisp"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"py"</span> . <span style="font-style: italic;">"src python"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"go"</span> . <span style="font-style: italic;">"src go"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"yaml"</span> . <span style="font-style: italic;">"src yaml"</span>))
  (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"json"</span> . <span style="font-style: italic;">"src json"</span>)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-make-toc
  <span style="font-weight: bold;">:hook</span> (org-mode . org-make-toc-mode))

(add-hook 'org-mode-hook #'org-make-toc-mode)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-appear
  <span style="font-weight: bold;">:hook</span> (org-mode . org-appear-mode))
</pre>
</div>
</div>
<div id="outline-container-orgb5e2fc4" class="outline-4">
<h4 id="orgb5e2fc4">Beautification</h4>
<div class="outline-text-4" id="text-orgb5e2fc4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-superstar
  <span style="font-weight: bold;">:custom</span>
  (org-superstar-special-todo-items t)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">not sure which setting of ~org-superstar-remove-leading-star~ I like the most</span>
  (org-superstar-remove-leading-stars nil)
  <span style="font-weight: bold;">:config</span>
  (add-hook 'org-mode-hook (<span style="font-weight: bold;">lambda</span> () (org-superstar-mode 1)))
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(setq org-superstar-headline-bullets-list '("&#9776;" "&#9783;" "&#9781;" "&#9778;"  "&#9779;" "&#9780;"  "&#9782;"  "&#9777;" ))</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(setq org-superstar-headline-bullets-list '("&#10006;" "&#10010;" "&#9673;" "&#9675;" "&#9654;"))</span>
  (<span style="font-weight: bold;">setq</span> org-superstar-headline-bullets-list '(<span style="font-style: italic;">"&#9670;"</span>))
  (<span style="font-weight: bold;">setq</span> org-superstar-cycle-headline-bullets nil)
  (<span style="font-weight: bold;">setq</span> org-ellipsis <span style="font-style: italic;">" &#8628; "</span>)
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">TODO this is something that should be done at every theme switch.</span>
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">we should have some form of hooks where we also generate a ~/.Xdefaults</span>
  (set-face-foreground 'org-superstar-leading (face-attribute 'default <span style="font-weight: bold;">:background</span>))
  (set-face-foreground 'org-hide (face-attribute 'default <span style="font-weight: bold;">:background</span>)))
</pre>
</div>
</div>
</div>
