neo/neo.html

<div id="outline-container-org7b57465" class="outline-4">
<h4 id="org7b57465">Applications</h4>
<div class="outline-text-4" id="text-org7b57465">
</div>
<ul class="org-ul">
<li><a id="org5bc2bb1"></a>Org Roam<br />
<div class="outline-text-5" id="text-org5bc2bb1">
<p>
Org roam is almost its own application.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-roam
  <span style="font-weight: bold;">:init</span>
  (<span style="font-weight: bold;">setq</span> org-roam-v2-ack t)
  <span style="font-weight: bold;">:custom</span>
  (org-roam-directory <span style="font-style: italic;">"~/Notes"</span>)
  (org-roam-dailies-directory <span style="font-style: italic;">"Journal/"</span>)
  (org-roam-completion-everywhere t)
  (org-roam-capture-templates
   '((<span style="font-style: italic;">"d"</span> <span style="font-style: italic;">"default"</span> plain
      #'org-roam-capture--get-point
      <span style="font-style: italic;">"%?"</span>
      <span style="font-weight: bold;">:file-name</span> <span style="font-style: italic;">"%&lt;%Y%m%d%H%M%S&gt;-${slug}"</span>
      <span style="font-weight: bold;">:head</span> <span style="font-style: italic;">"#+title: ${title}\n"</span>
      <span style="font-weight: bold;">:unnarrowed</span> t)))
  <span style="font-weight: bold;">:bind</span>
  ((<span style="font-style: italic;">"C-c n l"</span> . org-roam-buffer-toggle)
   (<span style="font-style: italic;">"C-c n f"</span> . org-roam-node-find)
   (<span style="font-style: italic;">"C-c n i"</span> . org-roam-node-insert)
   <span style="font-weight: bold;">:map</span> org-mode-map
   (<span style="font-style: italic;">"C-M-i"</span> . completion-at-point)
   <span style="font-weight: bold;">:map</span> org-roam-dailies-map
     (<span style="font-style: italic;">"Y"</span> . org-roam-dailies-capture-yesterday)
     (<span style="font-style: italic;">"T"</span> . org-roam-dailies-capture-tomorrow))
  <span style="font-weight: bold;">:bind-keymap</span>
  (<span style="font-style: italic;">"C-c n d"</span> . org-roam-dailies-map)
  <span style="font-weight: bold;">:config</span>
  (org-roam-setup))
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(use-package org-roam</span>
<span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">:hook</span>
<span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">(after-init . org-roam-mode)</span>
<span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">:config</span>
<span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">(setq org-roam-v2-ack t)</span>
<span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">:custom</span>
<span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">(org-roam-directory "~/Notes/Roam/")</span>
<span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">(org-roam-completion-everywhere t)</span>
<span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">(org-roam-completion-system 'default)</span>
<span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">(org-roam-capture-templates</span>
<span style="font-weight: bold; font-style: italic;">;;     </span><span style="font-weight: bold; font-style: italic;">'(("d" "default" plain</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">#'org-roam-capture--get-point</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">"%?"</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:file-name "%&lt;%Y%m%d%H%M%S&gt;-${slug}"</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:head "#+title: ${title}\n"</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:unnarrowed t)</span>
<span style="font-weight: bold; font-style: italic;">;;       </span><span style="font-weight: bold; font-style: italic;">("ll" "link note" plain</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">#'org-roam-capture--get-point</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">"* %^{Link}"</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:file-name "Inbox"</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:olp ("Links")</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:unnarrowed t</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:immediate-finish)</span>
<span style="font-weight: bold; font-style: italic;">;;       </span><span style="font-weight: bold; font-style: italic;">("lt" "link task" entry</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">#'org-roam-capture--get-point</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">"* TODO %^{Link}"</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:file-name "Inbox"</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:olp ("Tasks")</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:unnarrowed t</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:immediate-finish)))</span>
<span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">(org-roam-dailies-directory "Journal/")</span>
<span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">(org-roam-dailies-capture-templates</span>
<span style="font-weight: bold; font-style: italic;">;;     </span><span style="font-weight: bold; font-style: italic;">'(("d" "default" entry</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">#'org-roam-capture--get-point</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">"* %?"</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:file-name "Journal/%&lt;%Y-%m-%d&gt;"</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:head "#+title: %&lt;%Y-%m-%d %a&gt;\n\n[[roam:%&lt;%Y-%B&gt;]]\n\n")</span>
<span style="font-weight: bold; font-style: italic;">;;       </span><span style="font-weight: bold; font-style: italic;">("t" "Task" entry</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">#'org-roam-capture--get-point</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">"* TODO %?\n  %U\n  %a\n  %i"</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:file-name "Journal/%&lt;%Y-%m-%d&gt;"</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:olp ("Tasks")</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:empty-lines 1</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:head "#+title: %&lt;%Y-%m-%d %a&gt;\n\n[[roam:%&lt;%Y-%B&gt;]]\n\n")</span>
<span style="font-weight: bold; font-style: italic;">;;       </span><span style="font-weight: bold; font-style: italic;">("j" "journal" entry</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">#'org-roam-capture--get-point</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">"* %&lt;%I:%M %p&gt; - Journal  :journal:\n\n%?\n\n"</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:file-name "Journal/%&lt;%Y-%m-%d&gt;"</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:olp ("Log")</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:head "#+title: %&lt;%Y-%m-%d %a&gt;\n\n[[roam:%&lt;%Y-%B&gt;]]\n\n")</span>
<span style="font-weight: bold; font-style: italic;">;;       </span><span style="font-weight: bold; font-style: italic;">("l" "log entry" entry</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">#'org-roam-capture--get-point</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">"* %&lt;%I:%M %p&gt; - %?"</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:file-name "Journal/%&lt;%Y-%m-%d&gt;"</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:olp ("Log")</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:head "#+title: %&lt;%Y-%m-%d %a&gt;\n\n[[roam:%&lt;%Y-%B&gt;]]\n\n")</span>
<span style="font-weight: bold; font-style: italic;">;;       </span><span style="font-weight: bold; font-style: italic;">("m" "meeting" entry</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">#'org-roam-capture--get-point</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">"* %&lt;%I:%M %p&gt; - %^{Meeting Title}  :meetings:\n\n%?\n\n"</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:file-name "Journal/%&lt;%Y-%m-%d&gt;"</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:olp ("Log")</span>
<span style="font-weight: bold; font-style: italic;">;;        </span><span style="font-weight: bold; font-style: italic;">:head "#+title: %&lt;%Y-%m-%d %a&gt;\n\n[[roam:%&lt;%Y-%B&gt;]]\n\n")))</span>
<span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">:bind (:map org-roam-mode-map</span>
<span style="font-weight: bold; font-style: italic;">;;           </span><span style="font-weight: bold; font-style: italic;">(("C-c n l"   . org-roam)</span>
<span style="font-weight: bold; font-style: italic;">;;            </span><span style="font-weight: bold; font-style: italic;">("C-c n f"   . org-roam-find-file)</span>
<span style="font-weight: bold; font-style: italic;">;;            </span><span style="font-weight: bold; font-style: italic;">("C-c n d"   . org-roam-dailies-find-date)</span>
<span style="font-weight: bold; font-style: italic;">;;            </span><span style="font-weight: bold; font-style: italic;">("C-c n c"   . org-roam-dailies-capture-today)</span>
<span style="font-weight: bold; font-style: italic;">;;            </span><span style="font-weight: bold; font-style: italic;">("C-c n C r" . org-roam-dailies-capture-tomorrow)</span>
<span style="font-weight: bold; font-style: italic;">;;            </span><span style="font-weight: bold; font-style: italic;">("C-c n t"   . org-roam-dailies-find-today)</span>
<span style="font-weight: bold; font-style: italic;">;;            </span><span style="font-weight: bold; font-style: italic;">("C-c n y"   . org-roam-dailies-find-yesterday)</span>
<span style="font-weight: bold; font-style: italic;">;;            </span><span style="font-weight: bold; font-style: italic;">("C-c n r"   . org-roam-dailies-find-tomorrow)</span>
<span style="font-weight: bold; font-style: italic;">;;            </span><span style="font-weight: bold; font-style: italic;">("C-c n g"   . org-roam-graph))</span>
<span style="font-weight: bold; font-style: italic;">;;          </span><span style="font-weight: bold; font-style: italic;">:map org-mode-map</span>
<span style="font-weight: bold; font-style: italic;">;;          </span><span style="font-weight: bold; font-style: italic;">(("C-c n i" . org-roam-insert))</span>
<span style="font-weight: bold; font-style: italic;">;;          </span><span style="font-weight: bold; font-style: italic;">(("C-c n I" . org-roam-insert-immediate))))</span>
</pre>
</div>
</div>
</li>
