content/neo/neo.org
**** Org Chef

#+begin_src emacs-lisp
  (use-package org-chef)
  (setq org-capture-templates
      '(("c" "Cookbook" entry (file "~/org/cookbook.org")
         "%(org-chef-get-recipe-from-url)"
         :empty-lines 1)
        ("m" "Manual Cookbook" entry (file "~/org/cookbook.org")
         "* %^{Recipe title: }\n  :PROPERTIES:\n  :source-url:\n  :servings:\n  :prep-time:\n  :cook-time:\n  :ready-in:\n  :END:\n** Ingredients\n   %?\n** Directions\n\n")))
#+end_src
**** Org Reveal

#+begin_src emacs-lisp
  (use-package ox-reveal)
  ;; or from https://cdn.jsdelivr.net/npm/reveal.js
  (setq org-reveal-root "file:///home/mav/.nvm/versions/node/v11.15.0/lib/node_modules/reveal.js")
  (setq org-re-reveal-external-plugins  '((progress . "{ src: '%s/plugin/toc-progress/toc-progress.js', async: true, callback: function() { toc_progress.initialize(); toc_progress.create();} }")))
#+end_src
** Dashboard
** Calculator
** Calendar
** File Browser
** Shell

Look at more vterm/zsh configuration at
https://github.com/akermu/emacs-libvterm#fonts

Also https://github.com/suonlight/multi-vterm

#+BEGIN_SRC emacs-lisp
  (use-package vterm
    :ensure-system-package cmake
    :ensure-system-package libtool-bin
    :custom
    (vterm-max-scrollback 10000)
    (vterm-shell "zsh")
    :config
    (defun turn-off-chrome ()
      (hl-line-mode -1)
      (display-line-numbers-mode -1))
    :hook (vterm-mode . turn-off-chrome))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package vterm-toggle
    :custom
    (vterm-toggle-fullscreen-p t)
    (vterm-toggle-scope 'project)
    :bind (("s-t" . #'vterm-toggle)
           :map vterm-mode-map
           ("s-t" . #'vterm-toggle)))
#+END_SRC

** Alert

https://github.com/jwiegley/alert

#+begin_src emacs-lisp
(use-package alert
  :commands alert
  :config
  (setq alert-default-style 'notifications))
#+end_src

** File Browser

#+begin_src emacs-lisp
(use-package treemacs)
#+end_src


* Fun
** Music
*** Player

#+begin_src emacs-lisp
(use-package emms
    :config
    (emms-all)
    (emms-default-players)
    (setq emms-player-list '(emms-player-vlc))
    (setq emms-source-file-default-directory "~/Music/")
    (setq emms-info-functions '(emms-info-mp3info)))
#+end_src

*** Lyrics
#+begin_src emacs-lisp
(use-package lyrics-fetcher
  :straight (:host github :repo "SqrtMinusOne/lyrics-fetcher.el"))
#+end_src
* Unclassified Packages
