neo/neo.html

<li><a id="org26108a2"></a>Org Chef<br />
<div class="outline-text-5" id="text-org26108a2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-chef)
(<span style="font-weight: bold;">setq</span> org-capture-templates
    '((<span style="font-style: italic;">"c"</span> <span style="font-style: italic;">"Cookbook"</span> entry (file <span style="font-style: italic;">"~/org/cookbook.org"</span>)
       <span style="font-style: italic;">"%(org-chef-get-recipe-from-url)"</span>
       <span style="font-weight: bold;">:empty-lines</span> 1)
      (<span style="font-style: italic;">"m"</span> <span style="font-style: italic;">"Manual Cookbook"</span> entry (file <span style="font-style: italic;">"~/org/cookbook.org"</span>)
       <span style="font-style: italic;">"* %^{Recipe title: }\n  :PROPERTIES:\n  :source-url:\n  :servings:\n  :prep-time:\n  :cook-time:\n  :ready-in:\n  :END:\n** Ingredients\n   %?\n** Directions\n\n"</span>)))
</pre>
</div>
</div>
</li>
<li><a id="org8405cae"></a>Org Reveal<br />
<div class="outline-text-5" id="text-org8405cae">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ox-reveal)
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">or from https://cdn.jsdelivr.net/npm/reveal.js</span>
(<span style="font-weight: bold;">setq</span> org-reveal-root <span style="font-style: italic;">"file:///home/mav/.nvm/versions/node/v11.15.0/lib/node_modules/reveal.js"</span>)
(<span style="font-weight: bold;">setq</span> org-re-reveal-external-plugins  '((progress . <span style="font-style: italic;">"{ src: '%s/plugin/toc-progress/toc-progress.js', async: true, callback: function() { toc_progress.initialize(); toc_progress.create();} }"</span>)))
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgbf05f0e" class="outline-3">
<h3 id="orgbf05f0e">Dashboard</h3>
</div>
<div id="outline-container-orgec0aa4f" class="outline-3">
<h3 id="orgec0aa4f">Calculator</h3>
</div>
<div id="outline-container-org70633e7" class="outline-3">
<h3 id="org70633e7">Calendar</h3>
</div>
<div id="outline-container-org571d481" class="outline-3">
<h3 id="org571d481">File Browser</h3>
</div>
<div id="outline-container-org716ea47" class="outline-3">
<h3 id="org716ea47">Shell</h3>
<div class="outline-text-3" id="text-org716ea47">
<p>
Look at more vterm/zsh configuration at
<a href="https://github.com/akermu/emacs-libvterm#fonts">https://github.com/akermu/emacs-libvterm#fonts</a>
</p>

<p>
Also <a href="https://github.com/suonlight/multi-vterm">https://github.com/suonlight/multi-vterm</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package vterm
  <span style="font-weight: bold;">:ensure-system-package</span> cmake
  <span style="font-weight: bold;">:ensure-system-package</span> libtool-bin
  <span style="font-weight: bold;">:custom</span>
  (vterm-max-scrollback 10000)
  (vterm-shell <span style="font-style: italic;">"zsh"</span>)
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">turn-off-chrome</span> ()
    (hl-line-mode -1)
    (display-line-numbers-mode -1))
  <span style="font-weight: bold;">:hook</span> (vterm-mode . turn-off-chrome))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package vterm-toggle
  <span style="font-weight: bold;">:custom</span>
  (vterm-toggle-fullscreen-p t)
  (vterm-toggle-scope 'project)
  <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"s-t"</span> . #'vterm-toggle)
         <span style="font-weight: bold;">:map</span> vterm-mode-map
         (<span style="font-style: italic;">"s-t"</span> . #'vterm-toggle)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4bfc98" class="outline-3">
<h3 id="orgf4bfc98">Alert</h3>
<div class="outline-text-3" id="text-orgf4bfc98">
<p>
<a href="https://github.com/jwiegley/alert">https://github.com/jwiegley/alert</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package alert
  <span style="font-weight: bold;">:commands</span> alert
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> alert-default-style 'notifications))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge5b0adc" class="outline-3">
<h3 id="orge5b0adc">File Browser</h3>
<div class="outline-text-3" id="text-orge5b0adc">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package treemacs)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgcb8bdda" class="outline-2">
<h2 id="orgcb8bdda">Fun</h2>
<div class="outline-text-2" id="text-orgcb8bdda">
</div>
<div id="outline-container-org1a82c16" class="outline-3">
<h3 id="org1a82c16">Music</h3>
<div class="outline-text-3" id="text-org1a82c16">
</div>
<div id="outline-container-org8f202c8" class="outline-4">
<h4 id="org8f202c8">Player</h4>
<div class="outline-text-4" id="text-org8f202c8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package emms
    <span style="font-weight: bold;">:config</span>
    (emms-all)
    (emms-default-players)
    (<span style="font-weight: bold;">setq</span> emms-player-list '(emms-player-vlc))
    (<span style="font-weight: bold;">setq</span> emms-source-file-default-directory <span style="font-style: italic;">"~/Music/"</span>)
    (<span style="font-weight: bold;">setq</span> emms-info-functions '(emms-info-mp3info)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8241da3" class="outline-4">
<h4 id="org8241da3">Lyrics</h4>
<div class="outline-text-4" id="text-org8241da3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package lyrics-fetcher
  <span style="font-weight: bold;">:straight</span> (<span style="font-weight: bold;">:host</span> github <span style="font-weight: bold;">:repo</span> <span style="font-style: italic;">"SqrtMinusOne/lyrics-fetcher.el"</span>))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org2d21c9a" class="outline-2">
<h2 id="org2d21c9a">Unclassified Packages</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
